-- phpMyAdmin SQL Dump
-- version 5.2.0
-- https://www.phpmyadmin.net/
--
-- Хост: 127.0.0.1:3306
-- Время создания: Июн 02 2024 г., 11:54
-- Версия сервера: 5.6.51
-- Версия PHP: 8.1.9

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База данных: `laravel_api`
--

-- --------------------------------------------------------

--
-- Структура таблицы `failed_jobs`
--

CREATE TABLE `failed_jobs` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `uuid` varchar(191) COLLATE utf8mb4_unicode_ci NOT NULL,
  `connection` text COLLATE utf8mb4_unicode_ci NOT NULL,
  `queue` text COLLATE utf8mb4_unicode_ci NOT NULL,
  `payload` longtext COLLATE utf8mb4_unicode_ci NOT NULL,
  `exception` longtext COLLATE utf8mb4_unicode_ci NOT NULL,
  `failed_at` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Структура таблицы `incomes`
--

CREATE TABLE `incomes` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `number` varchar(191) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `income_id` int(11) NOT NULL,
  `date` date NOT NULL,
  `last_change_date` date NOT NULL,
  `supplier_article` varchar(191) COLLATE utf8mb4_unicode_ci NOT NULL,
  `tech_size` varchar(191) COLLATE utf8mb4_unicode_ci NOT NULL,
  `barcode` varchar(191) COLLATE utf8mb4_unicode_ci NOT NULL,
  `quantity` int(11) NOT NULL,
  `total_price` decimal(10,2) NOT NULL DEFAULT '0.00',
  `date_close` date NOT NULL,
  `warehouse_name` varchar(191) COLLATE utf8mb4_unicode_ci NOT NULL,
  `nm_id` bigint(20) UNSIGNED NOT NULL,
  `status` varchar(191) COLLATE utf8mb4_unicode_ci NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Структура таблицы `migrations`
--

CREATE TABLE `migrations` (
  `id` int(10) UNSIGNED NOT NULL,
  `migration` varchar(191) COLLATE utf8mb4_unicode_ci NOT NULL,
  `batch` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Дамп данных таблицы `migrations`
--

INSERT INTO `migrations` (`id`, `migration`, `batch`) VALUES
(1, '2014_10_12_000000_create_users_table', 1),
(2, '2014_10_12_100000_create_password_reset_tokens_table', 1),
(3, '2019_08_19_000000_create_failed_jobs_table', 1),
(4, '2019_12_14_000001_create_personal_access_tokens_table', 1),
(5, '2024_05_31_071809_create_stocks_table', 1),
(6, '2024_05_31_112105_create_incomes_table', 2),
(8, '2024_06_01_073220_update_incomes_table', 3),
(9, '2024_06_01_075056_create_sales_table', 4),
(10, '2024_06_01_081801_create_orders_table', 5);

-- --------------------------------------------------------

--
-- Структура таблицы `orders`
--

CREATE TABLE `orders` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `g_number` varchar(191) COLLATE utf8mb4_unicode_ci NOT NULL,
  `date` date NOT NULL,
  `last_change_date` date NOT NULL,
  `supplier_article` varchar(191) COLLATE utf8mb4_unicode_ci NOT NULL,
  `tech_size` varchar(191) COLLATE utf8mb4_unicode_ci NOT NULL,
  `barcode` varchar(191) COLLATE utf8mb4_unicode_ci NOT NULL,
  `total_price` int(11) NOT NULL,
  `discount_percent` int(11) NOT NULL,
  `warehouse_name` varchar(191) COLLATE utf8mb4_unicode_ci NOT NULL,
  `oblast` varchar(191) COLLATE utf8mb4_unicode_ci NOT NULL,
  `income_id` bigint(20) NOT NULL,
  `odid` bigint(20) DEFAULT NULL,
  `nm_id` bigint(20) NOT NULL,
  `subject` varchar(191) COLLATE utf8mb4_unicode_ci NOT NULL,
  `category` varchar(191) COLLATE utf8mb4_unicode_ci NOT NULL,
  `brand` varchar(191) COLLATE utf8mb4_unicode_ci NOT NULL,
  `is_cancel` tinyint(1) NOT NULL,
  `cancel_dt` timestamp NULL DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Дамп данных таблицы `orders`
--

INSERT INTO `orders` (`id`, `g_number`, `date`, `last_change_date`, `supplier_article`, `tech_size`, `barcode`, `total_price`, `discount_percent`, `warehouse_name`, `oblast`, `income_id`, `odid`, `nm_id`, `subject`, `category`, `brand`, `is_cancel`, `cancel_dt`, `created_at`, `updated_at`) VALUES
(1, '9862693075207462474', '2024-05-30', '2024-05-30', 'a_200526896', 's_296', '7546276519753', 464, 20, 'Электросталь', 'Москва', 18901099, NULL, 348842457, 'subject_1645', 'category_03405', 'brand_4842913', 0, NULL, '2024-06-01 08:31:35', '2024-06-01 08:31:35'),
(2, '98020879861522618074', '2024-05-30', '2024-05-30', 'a_034339447', 's_296', '9493685515868', 1888, 20, 'Казань', 'Забайкальский край', 20202500, NULL, 601413913, 'subject_1153', 'category_03405', 'brand_6791887', 0, NULL, '2024-06-01 08:31:35', '2024-06-01 08:31:35'),
(3, '6243178342576335501', '2024-05-30', '2024-05-30', 'a_057754175', 's_296', '7119289646772', 4644, 0, 'Тула', 'Республика Саха (Якутия)', 18901099, NULL, 378715046, 'subject_7025', 'category_03405', 'brand_1943385', 0, NULL, '2024-06-01 08:31:35', '2024-06-01 08:31:35'),
(4, '1014230916589361412', '2024-05-30', '2024-05-30', 'a_559465974', 's_296', '5460722218221', 1124, 20, 'Казань', 'Республика Саха (Якутия)', 20202500, NULL, 975961805, 'subject_1153', 'category_03405', 'brand_6791887', 0, NULL, '2024-06-01 08:31:35', '2024-06-01 08:31:35'),
(5, '3512579854274044124', '2024-05-30', '2024-05-30', 'a_223493109', 's_296', '2324950870110', 685, 24, 'Казань', 'Красноярский край', 20202500, NULL, 143224180, 'subject_1153', 'category_03405', 'brand_6791887', 0, NULL, '2024-06-01 08:31:35', '2024-06-01 08:31:35'),
(6, '93818845441618896562', '2024-05-30', '2024-05-30', 'a_295755025', 's_296', '6345980147877', 1815, 1, 'Электросталь', 'Приморский край', 19536914, NULL, 348022198, 'subject_1645', 'category_03405', 'brand_6791887', 0, NULL, '2024-06-01 08:31:35', '2024-06-01 08:31:35'),
(7, '92751084672482159368', '2024-05-30', '2024-05-30', 'a_752661802', 's_296', '9581162935374', 1858, 0, 'Казань', 'Тюменская область', 19273056, NULL, 347272131, 'subject_7025', 'category_03405', 'brand_1943385', 0, NULL, '2024-06-01 08:31:35', '2024-06-01 08:31:35'),
(8, '97407615752552482862', '2024-05-30', '2024-05-30', 'a_202443053', 's_296', '5190929071588', 1700, 20, 'Электросталь', 'Новосибирская область', 20201940, NULL, 394743166, 'subject_6037', 'category_03405', 'brand_4968105', 0, NULL, '2024-06-01 08:31:35', '2024-06-01 08:31:35'),
(9, '97407615752552482862', '2024-05-30', '2024-05-30', 'a_202443053', 's_296', '5190929071588', 1700, 20, 'Электросталь', 'Новосибирская область', 20201940, NULL, 394743166, 'subject_6037', 'category_03405', 'brand_4968105', 0, NULL, '2024-06-01 08:31:35', '2024-06-01 08:31:35'),
(10, '97407615752552482862', '2024-05-30', '2024-05-30', 'a_202443053', 's_296', '5190929071588', 1700, 20, 'Электросталь', 'Новосибирская область', 20201940, NULL, 394743166, 'subject_6037', 'category_03405', 'brand_4968105', 0, NULL, '2024-06-01 08:31:35', '2024-06-01 08:31:35'),
(11, '3158281665623397469', '2024-05-30', '2024-05-30', 'a_752661802', 's_296', '9581162935374', 1858, 0, 'Казань', 'Свердловская область', 19273056, NULL, 347272131, 'subject_7025', 'category_03405', 'brand_1943385', 0, NULL, '2024-06-01 08:31:35', '2024-06-01 08:31:35'),
(12, '98370779020359975942', '2024-05-30', '2024-05-30', 'a_270717918', 's_296', '4886197766357', 552, 20, 'Электросталь', 'Краснодарский край', 19536914, NULL, 32627376, 'subject_1645', 'category_03405', 'brand_4842913', 0, NULL, '2024-06-01 08:31:35', '2024-06-01 08:31:35'),
(13, '97021311100472335463', '2024-05-30', '2024-05-30', 'a_262258994', 's_296', '3343804767992', 1198, 24, 'Казань', 'Чувашская Республика', 20202500, NULL, 380090997, 'subject_1153', 'category_03405', 'brand_6791887', 0, NULL, '2024-06-01 08:31:35', '2024-06-01 08:31:35'),
(14, '5902489845274584496', '2024-05-30', '2024-05-30', 'a_362671669', 's_296', '3141473083083', 2460, 0, 'Казань', 'Пермский край', 14740467, NULL, 472557830, 'subject_3082', 'category_03405', 'brand_1943385', 0, NULL, '2024-06-01 08:31:35', '2024-06-01 08:31:35'),
(15, '92771439083144450900', '2024-05-30', '2024-05-30', 'a_939941307', 's_296', '5242671265788', 384, 20, 'Казань', 'Забайкальский край', 0, NULL, 899907980, 'subject_1645', 'category_03405', 'brand_4842913', 1, '2024-05-29 21:00:00', '2024-06-01 08:31:35', '2024-06-01 08:31:35'),
(16, '8463104797743621035', '2024-05-30', '2024-05-30', 'a_198999182', 's_296', '8870470274357', 302, 0, 'Электросталь', 'Санкт-Петербург', 19536914, NULL, 100749624, 'subject_0229', 'category_03405', 'brand_1943385', 0, NULL, '2024-06-01 08:31:35', '2024-06-01 08:31:35'),
(17, '95195847943673726108', '2024-05-30', '2024-05-30', 'a_206004302', 's_296', '0070448162631', 796, 0, 'Казань', 'Ульяновская область', 20494342, NULL, 982315624, 'subject_1153', 'category_03405', 'brand_7501118', 0, NULL, '2024-06-01 08:31:35', '2024-06-01 08:31:35'),
(18, '92422155515315238', '2024-05-30', '2024-05-30', 'a_575598574', 's_296', '7307808192577', 785, 0, 'Электросталь', 'Ярославская область', 20201940, NULL, 98783590, 'subject_1153', 'category_03405', 'brand_7501118', 0, NULL, '2024-06-01 08:31:36', '2024-06-01 08:31:36'),
(19, '9674989223599155066', '2024-05-30', '2024-05-30', 'a_419227451', 's_296', '2327922359328', 826, 0, 'Казань', 'Чувашская Республика', 19272807, NULL, 56898525, 'subject_1153', 'category_03405', 'brand_7501118', 0, NULL, '2024-06-01 08:31:36', '2024-06-01 08:31:36'),
(20, '4781809610700285594', '2024-05-30', '2024-05-30', 'a_949551420', 's_296', '0208889848275', 2095, 20, 'Казань', 'Республика Бурятия', 20202500, NULL, 828668392, 'subject_1153', 'category_03405', 'brand_6791887', 0, NULL, '2024-06-01 08:31:36', '2024-06-01 08:31:36'),
(21, '95082500136663115566', '2024-05-30', '2024-05-30', 'a_752661802', 's_296', '9581162935374', 1858, 0, 'Электросталь', 'Владимирская область', 14589230, NULL, 347272131, 'subject_7025', 'category_03405', 'brand_1943385', 0, NULL, '2024-06-01 08:31:36', '2024-06-01 08:31:36'),
(22, '2903127937324129544', '2024-05-30', '2024-05-30', 'a_939941307', 's_296', '5242671265788', 384, 20, 'Казань', 'Красноярский край', 19273056, NULL, 899907980, 'subject_1645', 'category_03405', 'brand_4842913', 0, NULL, '2024-06-01 08:31:36', '2024-06-01 08:31:36'),
(23, '94160318933600133980', '2024-05-30', '2024-05-30', 'a_895964763', 's_296', '6049855848659', 929, 20, 'Казань', 'Нижегородская область', 20202500, NULL, 447705614, 'subject_8623', 'category_03405', 'brand_2096932', 0, NULL, '2024-06-01 08:31:36', '2024-06-01 08:31:36'),
(24, '5665010089213595700', '2024-05-30', '2024-05-30', 'a_575598574', 's_296', '7307808192577', 785, 0, 'Казань', 'Оренбургская область', 20494342, NULL, 98783590, 'subject_1153', 'category_03405', 'brand_7501118', 0, NULL, '2024-06-01 08:31:36', '2024-06-01 08:31:36'),
(25, '96353712836225677110', '2024-05-30', '2024-05-30', 'a_752661802', 's_296', '9581162935374', 1858, 0, 'Казань', 'Республика Бурятия', 19273056, NULL, 347272131, 'subject_7025', 'category_03405', 'brand_1943385', 0, NULL, '2024-06-01 08:31:36', '2024-06-01 08:31:36'),
(26, '91040927038036346171', '2024-05-30', '2024-05-30', 'a_937327368', 's_296', '0862098409761', 3108, 7, 'Электросталь', 'Москва', 19536914, NULL, 9616784, 'subject_0229', 'category_03405', 'brand_2096932', 0, NULL, '2024-06-01 08:31:36', '2024-06-01 08:31:36'),
(27, '91802492408063173092', '2024-05-30', '2024-05-30', 'a_034339447', 's_296', '9493685515868', 1888, 20, 'Электросталь', 'Москва', 20201940, NULL, 601413913, 'subject_1153', 'category_03405', 'brand_6791887', 0, NULL, '2024-06-01 08:31:36', '2024-06-01 08:31:36'),
(28, '91801542426994746345', '2024-05-30', '2024-05-30', 'a_649012532', 's_296', '7250330886437', 2267, 0, 'Электросталь', 'Рязанская область', 15015721, NULL, 482116915, 'subject_3082', 'category_03405', 'brand_1943385', 0, NULL, '2024-06-01 08:31:36', '2024-06-01 08:31:36'),
(29, '93010909254649682837', '2024-05-30', '2024-05-30', 'a_202902843', 's_296', '5861021615024', 2151, 0, 'Электросталь', 'Московская область', 14502820, NULL, 278608376, 'subject_7025', 'category_03405', 'brand_2425706', 0, NULL, '2024-06-01 08:31:36', '2024-06-01 08:31:36'),
(30, '2618587107769387858', '2024-05-30', '2024-05-30', 'a_202902843', 's_296', '5861021615024', 2151, 0, 'Электросталь', 'Приморский край', 14502820, NULL, 278608376, 'subject_7025', 'category_03405', 'brand_2425706', 0, NULL, '2024-06-01 08:31:36', '2024-06-01 08:31:36'),
(31, '8245621204386283693', '2024-05-30', '2024-05-30', 'a_202902843', 's_296', '5861021615024', 2151, 0, 'Электросталь', 'Сахалинская область', 14502820, NULL, 278608376, 'subject_7025', 'category_03405', 'brand_2425706', 0, NULL, '2024-06-01 08:31:36', '2024-06-01 08:31:36'),
(32, '2953982221038754585', '2024-05-30', '2024-05-30', 'a_895964763', 's_296', '6049855848659', 929, 20, 'Казань', 'Саратовская область', 20202500, NULL, 447705614, 'subject_8623', 'category_03405', 'brand_2096932', 0, NULL, '2024-06-01 08:31:36', '2024-06-01 08:31:36'),
(33, '6167754993680603741', '2024-05-30', '2024-05-30', 'a_274607887', 's_296', '3437524930869', 2891, 0, 'Казань', 'Пермский край', 19273056, NULL, 992061869, 'subject_7025', 'category_03405', 'brand_1943385', 0, NULL, '2024-06-01 08:31:36', '2024-06-01 08:31:36'),
(34, '98205288030798219238', '2024-05-30', '2024-05-30', 'a_665459598', 's_296', '8415178856325', 501, 40, 'Коледино', 'Ульяновская область', 0, NULL, 239836944, 'subject_4734', 'category_03405', 'brand_6393790', 0, NULL, '2024-06-01 08:31:36', '2024-06-01 08:31:36'),
(35, '96383832037881219891', '2024-05-30', '2024-05-30', 'a_742809034', 's_296', '7032656948313', 482, 0, 'Электросталь', 'Московская область', 17894545, NULL, 181382282, 'subject_0229', 'category_03405', 'brand_1943385', 0, NULL, '2024-06-01 08:31:36', '2024-06-01 08:31:36'),
(36, '6202143489639128112', '2024-05-30', '2024-05-30', 'a_583885475', 's_296', '0217121900243', 710, 10, 'Электросталь', 'Краснодарский край', 18552715, NULL, 686864233, 'subject_3171', 'category_03405', 'brand_1943385', 0, NULL, '2024-06-01 08:31:36', '2024-06-01 08:31:36'),
(37, '96749286234240012823', '2024-05-30', '2024-05-30', 'a_583885475', 's_296', '0217121900243', 710, 10, 'Электросталь', 'Алтайский край', 18552715, NULL, 686864233, 'subject_3171', 'category_03405', 'brand_1943385', 0, NULL, '2024-06-01 08:31:36', '2024-06-01 08:31:36'),
(38, '95385331273998708535', '2024-05-30', '2024-05-30', 'a_939941307', 's_296', '5242671265788', 384, 20, 'Казань', 'Забайкальский край', 19273056, NULL, 899907980, 'subject_1645', 'category_03405', 'brand_4842913', 0, NULL, '2024-06-01 08:31:36', '2024-06-01 08:31:36'),
(39, '9121815868924065665', '2024-05-30', '2024-05-30', 'a_858269517', 's_296', '8248672656899', 1628, 20, 'Казань', 'Иркутская область', 20202500, NULL, 453316100, 'subject_1153', 'category_03405', 'brand_6791887', 0, NULL, '2024-06-01 08:31:37', '2024-06-01 08:31:37'),
(40, '96216178889531502114', '2024-05-30', '2024-05-30', 'a_179732125', 's_296', '5863595470792', 2342, 0, 'Электросталь', 'Москва', 20201940, NULL, 769057349, 'subject_1153', 'category_03405', 'brand_7501118', 0, NULL, '2024-06-01 08:31:37', '2024-06-01 08:31:37'),
(41, '92549899539315927086', '2024-05-30', '2024-05-30', 'a_949551420', 's_296', '0208889848275', 2095, 20, 'Электросталь', 'Московская область', 19536899, NULL, 828668392, 'subject_1153', 'category_03405', 'brand_6791887', 0, NULL, '2024-06-01 08:31:37', '2024-06-01 08:31:37'),
(42, '4864056820344572138', '2024-05-30', '2024-05-30', 'a_509287633', 's_296', '1984134762867', 2093, 20, 'Электросталь', 'Оренбургская область', 19536899, NULL, 456059970, 'subject_1153', 'category_03405', 'brand_6791887', 0, NULL, '2024-06-01 08:31:37', '2024-06-01 08:31:37'),
(43, '98642185109450738552', '2024-05-30', '2024-05-30', 'a_202902843', 's_296', '5861021615024', 2151, 0, 'Электросталь', 'Москва', 14502820, NULL, 278608376, 'subject_7025', 'category_03405', 'brand_2425706', 0, NULL, '2024-06-01 08:31:37', '2024-06-01 08:31:37'),
(44, '94309015562020226319', '2024-05-30', '2024-05-30', 'a_202902843', 's_296', '5861021615024', 2151, 0, 'Электросталь', 'Санкт-Петербург', 14502820, NULL, 278608376, 'subject_7025', 'category_03405', 'brand_2425706', 0, NULL, '2024-06-01 08:31:37', '2024-06-01 08:31:37'),
(45, '2705495229133608438', '2024-05-30', '2024-05-30', 'a_202902843', 's_296', '5861021615024', 2151, 0, 'Казань', 'Кировская область', 19273056, NULL, 278608376, 'subject_7025', 'category_03405', 'brand_2425706', 0, NULL, '2024-06-01 08:31:37', '2024-06-01 08:31:37'),
(46, '2332540986261127337', '2024-05-30', '2024-05-30', 'a_083834457', 's_296', '6245259554078', 362, 0, 'Коледино', 'Орловская область', 19536914, NULL, 908073440, 'subject_0229', 'category_03405', 'brand_1943385', 0, NULL, '2024-06-01 08:31:37', '2024-06-01 08:31:37'),
(47, '3408716198890681315', '2024-05-30', '2024-05-30', 'a_807756089', 's_296', '0773093846744', 2014, 20, 'Казань', 'Иркутская область', 20202500, NULL, 879799252, 'subject_8623', 'category_03405', 'brand_2096932', 0, NULL, '2024-06-01 08:31:37', '2024-06-01 08:31:37'),
(48, '8031511173467172808', '2024-05-30', '2024-05-30', 'a_262258994', 's_296', '3343804767992', 1198, 24, 'Казань', 'Ханты-Мансийский автономный округ', 20202500, NULL, 380090997, 'subject_1153', 'category_03405', 'brand_6791887', 0, NULL, '2024-06-01 08:31:37', '2024-06-01 08:31:37'),
(49, '8350119430557119869', '2024-05-30', '2024-05-30', 'a_690259960', 's_296', '2195893386521', 1052, 10, 'Казань', 'Иркутская область', 20202500, NULL, 698501855, 'subject_1153', 'category_03405', 'brand_6791887', 0, NULL, '2024-06-01 08:31:37', '2024-06-01 08:31:37'),
(50, '97318010236446241038', '2024-05-30', '2024-05-30', 'a_202902843', 's_296', '5861021615024', 2151, 0, 'Казань', 'Республика Хакасия', 19273056, NULL, 278608376, 'subject_7025', 'category_03405', 'brand_2425706', 0, NULL, '2024-06-01 08:31:37', '2024-06-01 08:31:37'),
(51, '1654270032358458505', '2024-05-30', '2024-05-30', 'a_745405957', 's_296', '4908589379123', 2974, 0, 'Электросталь', 'Ереван', 18901099, NULL, 971194465, 'subject_3082', 'category_03405', 'brand_1943385', 0, NULL, '2024-06-01 08:31:37', '2024-06-01 08:31:37'),
(52, '3928660170765156116', '2024-05-30', '2024-05-30', 'a_202902843', 's_296', '5861021615024', 2151, 0, 'Казань', 'Республика Татарстан', 19273056, NULL, 278608376, 'subject_7025', 'category_03405', 'brand_2425706', 0, NULL, '2024-06-01 08:31:37', '2024-06-01 08:31:37'),
(53, '8625393948646282779', '2024-05-30', '2024-05-30', 'a_202902843', 's_296', '5861021615024', 2151, 0, 'Краснодар', 'Ростовская область', 18901225, NULL, 278608376, 'subject_7025', 'category_03405', 'brand_2425706', 0, NULL, '2024-06-01 08:31:37', '2024-06-01 08:31:37'),
(54, '9880757942935190428', '2024-05-30', '2024-05-30', 'a_939941307', 's_296', '5242671265788', 384, 20, 'Казань', 'Нижегородская область', 19273056, NULL, 899907980, 'subject_1645', 'category_03405', 'brand_4842913', 0, NULL, '2024-06-01 08:31:37', '2024-06-01 08:31:37'),
(55, '97352093715934833017', '2024-05-30', '2024-05-30', 'a_462452710', 's_296', '8214933767622', 2647, 20, 'Электросталь', 'Приморский край', 18901099, NULL, 993464938, 'subject_4061', 'category_03405', 'brand_9449861', 0, NULL, '2024-06-01 08:31:37', '2024-06-01 08:31:37'),
(56, '284227796306078413', '2024-05-30', '2024-05-30', 'a_939941307', 's_296', '5242671265788', 384, 20, 'Тула', 'Московская область', 19536914, NULL, 899907980, 'subject_1645', 'category_03405', 'brand_4842913', 0, NULL, '2024-06-01 08:31:37', '2024-06-01 08:31:37'),
(57, '99194874610338319940', '2024-05-30', '2024-05-30', 'a_868221199', 's_296', '1393252391821', 8482, 20, 'Обухово', 'Свердловская область', 20202541, NULL, 231761208, 'subject_1153', 'category_03405', 'brand_6791887', 0, NULL, '2024-06-01 08:31:37', '2024-06-01 08:31:37'),
(58, '97999624892392534257', '2024-05-30', '2024-05-30', 'a_276829861', 's_296', '5736370179572', 612, 8, 'Электросталь', 'Иркутская область', 17562724, NULL, 954188640, 'subject_3171', 'category_03405', 'brand_1943385', 0, NULL, '2024-06-01 08:31:37', '2024-06-01 08:31:37'),
(59, '98386116516821652597', '2024-05-30', '2024-05-30', 'a_200526896', 's_296', '7546276519753', 464, 20, 'Электросталь', 'Московская область', 18901099, NULL, 348842457, 'subject_1645', 'category_03405', 'brand_4842913', 0, NULL, '2024-06-01 08:31:37', '2024-06-01 08:31:37'),
(60, '95992857079927092104', '2024-05-30', '2024-05-30', 'a_631406264', 's_296', '4666591544853', 2283, 0, 'Казань', 'Оренбургская область', 17246659, NULL, 120301206, 'subject_1153', 'category_03405', 'brand_7501118', 0, NULL, '2024-06-01 08:31:38', '2024-06-01 08:31:38'),
(61, '5464276219010952419', '2024-05-30', '2024-05-30', 'a_895964763', 's_296', '6049855848659', 929, 20, 'Казань', 'Республика Татарстан', 20202500, NULL, 447705614, 'subject_8623', 'category_03405', 'brand_2096932', 0, NULL, '2024-06-01 08:31:38', '2024-06-01 08:31:38'),
(62, '4940761702399623642', '2024-05-30', '2024-05-30', 'a_202902843', 's_296', '5861021615024', 2151, 0, 'Электросталь', 'Московская область', 14502820, NULL, 278608376, 'subject_7025', 'category_03405', 'brand_2425706', 0, NULL, '2024-06-01 08:31:38', '2024-06-01 08:31:38'),
(63, '95415592172321815948', '2024-05-30', '2024-05-30', 'a_202902843', 's_296', '5861021615024', 2151, 0, 'Казань', 'Томская область', 19273056, NULL, 278608376, 'subject_7025', 'category_03405', 'brand_2425706', 0, NULL, '2024-06-01 08:31:38', '2024-06-01 08:31:38'),
(64, '91217307684646964034', '2024-05-30', '2024-05-30', 'a_042752849', 's_296', '1517779649241', 4721, 0, 'Обухово', 'Чувашская Республика', 20202541, NULL, 533131028, 'subject_1153', 'category_03405', 'brand_7501118', 0, NULL, '2024-06-01 08:31:38', '2024-06-01 08:31:38'),
(65, '97073709629208529649', '2024-05-30', '2024-05-30', 'a_070262402', 's_296', '5304241194004', 7149, 20, 'Обухово', 'Севастополь', 20202541, NULL, 243739315, 'subject_1153', 'category_03405', 'brand_6791887', 0, NULL, '2024-06-01 08:31:38', '2024-06-01 08:31:38'),
(66, '8576059303602308238', '2024-05-30', '2024-05-30', 'a_262258994', 's_296', '3343804767992', 1198, 24, 'Казань', 'Нижегородская область', 20202500, NULL, 380090997, 'subject_1153', 'category_03405', 'brand_6791887', 0, NULL, '2024-06-01 08:31:38', '2024-06-01 08:31:38'),
(67, '98092963218885731229', '2024-05-30', '2024-05-30', 'a_198999182', 's_296', '8870470274357', 302, 0, 'Электросталь', 'Московская область', 19536914, NULL, 100749624, 'subject_0229', 'category_03405', 'brand_1943385', 0, NULL, '2024-06-01 08:31:38', '2024-06-01 08:31:38'),
(68, '2905070645438340459', '2024-05-30', '2024-05-30', 'a_575598574', 's_296', '7307808192577', 785, 0, 'Казань', 'Пермский край', 20494342, NULL, 98783590, 'subject_1153', 'category_03405', 'brand_7501118', 0, NULL, '2024-06-01 08:31:38', '2024-06-01 08:31:38'),
(69, '8362780071787873705', '2024-05-30', '2024-05-30', 'a_110158867', 's_296', '1764316925532', 1163, 20, 'Электросталь', 'Тамбовская область', 0, NULL, 961996756, 'subject_1153', 'category_03405', 'brand_6791887', 0, NULL, '2024-06-01 08:31:38', '2024-06-01 08:31:38'),
(70, '9200022884284171874', '2024-05-30', '2024-05-30', 'a_270717918', 's_296', '4886197766357', 552, 20, 'Казань', 'Чувашская Республика', 16031182, NULL, 32627376, 'subject_1645', 'category_03405', 'brand_4842913', 0, NULL, '2024-06-01 08:31:38', '2024-06-01 08:31:38'),
(71, '94377861609997377007', '2024-05-30', '2024-05-30', 'a_270717918', 's_296', '4886197766357', 552, 20, 'Казань', 'Удмуртская Республика', 16031182, NULL, 32627376, 'subject_1645', 'category_03405', 'brand_4842913', 0, NULL, '2024-06-01 08:31:38', '2024-06-01 08:31:38'),
(72, '91872474410584825270', '2024-05-30', '2024-05-30', 'a_202902843', 's_296', '5861021615024', 2151, 0, 'Казань', 'Омская область', 19273056, NULL, 278608376, 'subject_7025', 'category_03405', 'brand_2425706', 0, NULL, '2024-06-01 08:31:38', '2024-06-01 08:31:38'),
(73, '97600192555299649945', '2024-05-30', '2024-05-30', 'a_276829861', 's_296', '5736370179572', 612, 8, 'Электросталь', 'Тульская область', 17562724, NULL, 954188640, 'subject_3171', 'category_03405', 'brand_1943385', 0, NULL, '2024-06-01 08:31:38', '2024-06-01 08:31:38'),
(74, '8283065102467421624', '2024-05-30', '2024-05-30', 'a_265956939', 's_296', '0669155486206', 1687, 0, 'Казань', 'Кемеровская область', 18552715, NULL, 286077380, 'subject_7025', 'category_03405', 'brand_1943385', 0, NULL, '2024-06-01 08:31:38', '2024-06-01 08:31:38'),
(75, '6306982463193745696', '2024-05-30', '2024-05-30', 'a_575598574', 's_296', '7307808192577', 785, 0, 'Казань', 'Самарская область', 20494342, NULL, 98783590, 'subject_1153', 'category_03405', 'brand_7501118', 0, NULL, '2024-06-01 08:31:38', '2024-06-01 08:31:38'),
(76, '92659794686121845253', '2024-05-30', '2024-05-30', 'a_642817957', 's_296', '2166549609625', 1283, 20, 'Казань', 'Оренбургская область', 19272807, NULL, 81583115, 'subject_1153', 'category_03405', 'brand_6791887', 0, NULL, '2024-06-01 08:31:38', '2024-06-01 08:31:38'),
(77, '9179948540427625942', '2024-05-30', '2024-05-30', 'a_270717918', 's_296', '4886197766357', 552, 20, 'Казань', 'Новосибирская область', 16031182, NULL, 32627376, 'subject_1645', 'category_03405', 'brand_4842913', 0, NULL, '2024-06-01 08:31:38', '2024-06-01 08:31:38'),
(78, '96014025010284987376', '2024-05-30', '2024-05-30', 'a_034339447', 's_296', '9493685515868', 1888, 20, 'Казань', 'Республика Татарстан', 20202500, NULL, 601413913, 'subject_1153', 'category_03405', 'brand_6791887', 0, NULL, '2024-06-01 08:31:38', '2024-06-01 08:31:38'),
(79, '3920287276685164539', '2024-05-30', '2024-05-30', 'a_026704189', 's_296', '1532754510337', 5468, 20, 'Обухово', 'Краснодарский край', 17246252, NULL, 643266687, 'subject_1153', 'category_03405', 'brand_6791887', 0, NULL, '2024-06-01 08:31:38', '2024-06-01 08:31:38'),
(80, '91871053946724579744', '2024-05-30', '2024-05-30', 'a_026704189', 's_296', '1532754510337', 5468, 20, 'Обухово', 'Краснодарский край', 17246252, NULL, 643266687, 'subject_1153', 'category_03405', 'brand_6791887', 0, NULL, '2024-06-01 08:31:39', '2024-06-01 08:31:39'),
(81, '6285995952259723251', '2024-05-30', '2024-05-30', 'a_752661802', 's_296', '9581162935374', 2150, 0, 'Электросталь', 'Краснодарский край', 14589230, NULL, 347272131, 'subject_7025', 'category_03405', 'brand_1943385', 0, NULL, '2024-06-01 08:31:39', '2024-06-01 08:31:39'),
(82, '4055697226392462704', '2024-05-30', '2024-05-30', 'a_040305158', 's_296', '4927794987885', 1771, 0, 'Электросталь', 'Алтайский край', 14589230, NULL, 214364476, 'subject_7025', 'category_03405', 'brand_1943385', 0, NULL, '2024-06-01 08:31:39', '2024-06-01 08:31:39'),
(83, '93222527438347455651', '2024-05-30', '2024-05-30', 'a_413185826', 's_296', '9503955454672', 846, 0, 'Электросталь', 'Смоленская область', 0, NULL, 939709789, 'subject_1153', 'category_03405', 'brand_7501118', 0, NULL, '2024-06-01 08:31:39', '2024-06-01 08:31:39'),
(84, '93320180909273449878', '2024-05-30', '2024-05-30', 'a_607757220', 's_296', '7695667882474', 652, 19, 'Электросталь', 'Гродненская область', 19536914, NULL, 13443050, 'subject_1645', 'category_03405', 'brand_6791887', 0, NULL, '2024-06-01 08:31:39', '2024-06-01 08:31:39'),
(85, '4682864636266054097', '2024-05-30', '2024-05-30', 'a_939941307', 's_296', '5242671265788', 384, 20, 'Электросталь', 'Московская область', 19536914, NULL, 899907980, 'subject_1645', 'category_03405', 'brand_4842913', 0, NULL, '2024-06-01 08:31:39', '2024-06-01 08:31:39'),
(86, '98089913790609617932', '2024-05-30', '2024-05-30', 'a_939941307', 's_296', '5242671265788', 384, 20, 'Электросталь', 'Омская область', 19536914, NULL, 899907980, 'subject_1645', 'category_03405', 'brand_4842913', 0, NULL, '2024-06-01 08:31:39', '2024-06-01 08:31:39'),
(87, '97175745762808025265', '2024-05-30', '2024-05-30', 'a_745405957', 's_296', '4908589379123', 2988, 0, 'Электросталь', 'Московская область', 0, NULL, 971194465, 'subject_3082', 'category_03405', 'brand_1943385', 0, NULL, '2024-06-01 08:31:39', '2024-06-01 08:31:39'),
(88, '97514373731597857043', '2024-05-30', '2024-05-30', 'a_200526896', 's_296', '7546276519753', 464, 19, 'Электросталь', 'Брестская область', 18901099, NULL, 348842457, 'subject_1645', 'category_03405', 'brand_4842913', 0, NULL, '2024-06-01 08:31:39', '2024-06-01 08:31:39'),
(89, '9347766649545009409', '2024-05-30', '2024-05-30', 'a_462452710', 's_296', '8214933767622', 2647, 20, 'Электросталь', 'Мурманская область', 18901099, NULL, 993464938, 'subject_4061', 'category_03405', 'brand_9449861', 0, NULL, '2024-06-01 08:31:39', '2024-06-01 08:31:39'),
(90, '91362499317980543667', '2024-05-30', '2024-05-30', 'a_742809034', 's_296', '7032656948313', 482, 0, 'Электросталь', 'Санкт-Петербург', 17894545, NULL, 181382282, 'subject_0229', 'category_03405', 'brand_1943385', 0, NULL, '2024-06-01 08:31:39', '2024-06-01 08:31:39'),
(91, '97975083481902812669', '2024-05-30', '2024-05-30', 'a_642817957', 's_296', '2166549609625', 1280, 20, 'Электросталь', 'Московская область', 19536899, NULL, 81583115, 'subject_1153', 'category_03405', 'brand_6791887', 0, NULL, '2024-06-01 08:31:39', '2024-06-01 08:31:39'),
(92, '94691919643233395132', '2024-05-30', '2024-05-30', 'a_642817957', 's_296', '2166549609625', 1283, 20, 'Электросталь', 'Тульская область', 19536899, NULL, 81583115, 'subject_1153', 'category_03405', 'brand_6791887', 0, NULL, '2024-06-01 08:31:39', '2024-06-01 08:31:39'),
(93, '625016034906597129', '2024-05-30', '2024-05-30', 'a_862828954', 's_296', '6898521207045', 1010, 20, 'Казань', 'Саратовская область', 19273056, NULL, 822235188, 'subject_1645', 'category_03405', 'brand_4842913', 0, NULL, '2024-06-01 08:31:39', '2024-06-01 08:31:39'),
(94, '92936346791641723139', '2024-05-30', '2024-05-30', 'a_262258994', 's_296', '3343804767992', 1199, 24, 'Казань', 'Свердловская область', 20202500, NULL, 380090997, 'subject_1153', 'category_03405', 'brand_6791887', 0, NULL, '2024-06-01 08:31:39', '2024-06-01 08:31:39'),
(95, '91954277237590487327', '2024-05-30', '2024-05-30', 'a_862828954', 's_296', '6898521207045', 1010, 20, 'Казань', 'Свердловская область', 19273056, NULL, 822235188, 'subject_1645', 'category_03405', 'brand_4842913', 0, NULL, '2024-06-01 08:31:39', '2024-06-01 08:31:39'),
(96, '7473006638101312464', '2024-05-30', '2024-05-30', 'a_262258994', 's_296', '3343804767992', 1198, 24, 'Казань', 'Нижегородская область', 20202500, NULL, 380090997, 'subject_1153', 'category_03405', 'brand_6791887', 0, NULL, '2024-06-01 08:31:39', '2024-06-01 08:31:39'),
(97, '3491319168725103344', '2024-05-30', '2024-05-30', 'a_948199971', 's_296', '9635444746006', 4109, 0, 'Электросталь', 'Москва', 0, NULL, 710498219, 'subject_2968', 'category_03405', 'brand_1593720', 0, NULL, '2024-06-01 08:31:39', '2024-06-01 08:31:39'),
(98, '97977840662102397770', '2024-05-30', '2024-05-30', 'a_742809034', 's_296', '7032656948313', 482, 0, 'Электросталь', 'Москва', 0, NULL, 181382282, 'subject_0229', 'category_03405', 'brand_1943385', 0, NULL, '2024-06-01 08:31:39', '2024-06-01 08:31:39'),
(99, '97977840662102397770', '2024-05-30', '2024-05-30', 'a_742809034', 's_296', '7032656948313', 482, 0, 'Электросталь', 'Москва', 0, NULL, 181382282, 'subject_0229', 'category_03405', 'brand_1943385', 0, NULL, '2024-06-01 08:31:40', '2024-06-01 08:31:40'),
(100, '1078359570648344571', '2024-05-30', '2024-05-30', 'a_895964763', 's_296', '6049855848659', 929, 20, 'Казань', 'Самарская область', 0, NULL, 447705614, 'subject_8623', 'category_03405', 'brand_2096932', 0, NULL, '2024-06-01 08:31:40', '2024-06-01 08:31:40');

-- --------------------------------------------------------

--
-- Структура таблицы `password_reset_tokens`
--

CREATE TABLE `password_reset_tokens` (
  `email` varchar(191) COLLATE utf8mb4_unicode_ci NOT NULL,
  `token` varchar(191) COLLATE utf8mb4_unicode_ci NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Структура таблицы `personal_access_tokens`
--

CREATE TABLE `personal_access_tokens` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `tokenable_type` varchar(191) COLLATE utf8mb4_unicode_ci NOT NULL,
  `tokenable_id` bigint(20) UNSIGNED NOT NULL,
  `name` varchar(191) COLLATE utf8mb4_unicode_ci NOT NULL,
  `token` varchar(64) COLLATE utf8mb4_unicode_ci NOT NULL,
  `abilities` text COLLATE utf8mb4_unicode_ci,
  `last_used_at` timestamp NULL DEFAULT NULL,
  `expires_at` timestamp NULL DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Структура таблицы `sales`
--

CREATE TABLE `sales` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `g_number` varchar(191) COLLATE utf8mb4_unicode_ci NOT NULL,
  `date` date NOT NULL,
  `last_change_date` date NOT NULL,
  `supplier_article` varchar(191) COLLATE utf8mb4_unicode_ci NOT NULL,
  `tech_size` varchar(191) COLLATE utf8mb4_unicode_ci NOT NULL,
  `barcode` varchar(191) COLLATE utf8mb4_unicode_ci NOT NULL,
  `total_price` decimal(10,2) NOT NULL,
  `discount_percent` int(11) NOT NULL,
  `is_supply` tinyint(1) NOT NULL,
  `is_realization` tinyint(1) NOT NULL,
  `promo_code_discount` decimal(10,2) DEFAULT NULL,
  `warehouse_name` varchar(191) COLLATE utf8mb4_unicode_ci NOT NULL,
  `country_name` varchar(191) COLLATE utf8mb4_unicode_ci NOT NULL,
  `oblast_okrug_name` varchar(191) COLLATE utf8mb4_unicode_ci NOT NULL,
  `region_name` varchar(191) COLLATE utf8mb4_unicode_ci NOT NULL,
  `income_id` bigint(20) NOT NULL,
  `sale_id` varchar(191) COLLATE utf8mb4_unicode_ci NOT NULL,
  `odid` bigint(20) DEFAULT NULL,
  `spp` int(11) NOT NULL,
  `for_pay` decimal(10,2) NOT NULL,
  `finished_price` decimal(10,2) NOT NULL,
  `price_with_disc` decimal(10,2) NOT NULL,
  `nm_id` bigint(20) NOT NULL,
  `subject` varchar(191) COLLATE utf8mb4_unicode_ci NOT NULL,
  `category` varchar(191) COLLATE utf8mb4_unicode_ci NOT NULL,
  `brand` varchar(191) COLLATE utf8mb4_unicode_ci NOT NULL,
  `is_storno` tinyint(1) DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Дамп данных таблицы `sales`
--

INSERT INTO `sales` (`id`, `g_number`, `date`, `last_change_date`, `supplier_article`, `tech_size`, `barcode`, `total_price`, `discount_percent`, `is_supply`, `is_realization`, `promo_code_discount`, `warehouse_name`, `country_name`, `oblast_okrug_name`, `region_name`, `income_id`, `sale_id`, `odid`, `spp`, `for_pay`, `finished_price`, `price_with_disc`, `nm_id`, `subject`, `category`, `brand`, `is_storno`, `created_at`, `updated_at`) VALUES
(1, '954105647421410826', '2024-05-30', '2024-05-30', 'a_956381251', 's_296', '6999376265578', '-1728.00', 0, 0, 1, NULL, 'Электросталь', 'Россия', 'Южный федеральный округ', 'Краснодарский край', 19536914, 'R246908601', NULL, 12, '-1529.28', '-1459.00', '-1728.00', 23037765, 'subject_1645', 'category_03405', 'brand_6791887', NULL, '2024-06-01 05:07:46', '2024-06-01 05:07:46'),
(2, '98164773040192982466', '2024-05-31', '2024-05-31', 'a_752661802', 's_296', '9581162935374', '-2242.00', 0, 0, 1, NULL, 'Электросталь', 'Россия', 'Центральный федеральный округ', 'Рязанская область', 14589230, 'R247151262', NULL, 10, '-1984.17', '-2017.00', '-2242.00', 347272131, 'subject_7025', 'category_03405', 'brand_1943385', NULL, '2024-06-01 05:07:46', '2024-06-01 05:07:46'),
(3, '8322932515839538942', '2024-05-30', '2024-05-30', 'a_862828954', 's_296', '6898521207045', '817.00', 0, 0, 1, NULL, 'Электросталь', 'Россия', 'Дальневосточный федеральный округ', 'Камчатский край', 18552715, 'S9885353192', NULL, 0, '723.04', '863.00', '817.00', 822235188, 'subject_1645', 'category_03405', 'brand_4842913', NULL, '2024-06-01 05:07:46', '2024-06-01 05:07:46'),
(4, '96599065329229503810', '2024-05-30', '2024-05-30', 'a_862828954', 's_296', '6898521207045', '817.00', 0, 0, 1, NULL, 'Казань', 'Россия', 'Сибирский федеральный округ', 'Иркутская область', 19273056, 'S9885360275', NULL, 10, '723.04', '735.00', '817.00', 822235188, 'subject_1645', 'category_03405', 'brand_4842913', NULL, '2024-06-01 05:07:46', '2024-06-01 05:07:46'),
(5, '1564430082972567214', '2024-05-30', '2024-05-30', 'a_276829861', 's_296', '5736370179572', '610.00', 0, 0, 1, NULL, 'Коледино', 'Россия', 'Дальневосточный федеральный округ', 'Сахалинская область', 16887759, 'S9885363913', NULL, 11, '539.85', '544.00', '610.00', 954188640, 'subject_3171', 'category_03405', 'brand_1943385', NULL, '2024-06-01 05:07:46', '2024-06-01 05:07:46'),
(6, '4542792204339763184', '2024-05-30', '2024-05-30', 'a_607757220', 's_296', '7695667882474', '616.00', 0, 0, 1, NULL, 'Электросталь', 'Россия', 'Сибирский федеральный округ', 'Новосибирская область', 19536914, 'S9885585414', NULL, 10, '545.16', '554.00', '616.00', 13443050, 'subject_1645', 'category_03405', 'brand_6791887', NULL, '2024-06-01 05:07:46', '2024-06-01 05:07:46'),
(7, '93073413140268181563', '2024-05-30', '2024-05-30', 'a_336977266', 's_296', '9726525951508', '1073.00', 0, 0, 1, NULL, 'Электросталь', 'Россия', 'Сибирский федеральный округ', 'Красноярский край', 20201940, 'S9885765613', NULL, 10, '949.60', '965.00', '1073.00', 75392953, 'subject_1153', 'category_03405', 'brand_6791887', NULL, '2024-06-01 05:07:46', '2024-06-01 05:07:46'),
(8, '93073413140268181563', '2024-05-30', '2024-05-30', 'a_895964763', 's_296', '6049855848659', '1001.00', 0, 0, 1, NULL, 'Электросталь', 'Россия', 'Сибирский федеральный округ', 'Красноярский край', 20201940, 'S9885771328', NULL, 10, '885.88', '900.00', '1001.00', 447705614, 'subject_8623', 'category_03405', 'brand_2096932', NULL, '2024-06-01 05:07:46', '2024-06-01 05:07:46'),
(9, '5060607717268215807', '2024-05-30', '2024-05-30', 'a_939941307', 's_296', '5242671265788', '301.00', 0, 0, 1, NULL, 'Казань', 'Россия', 'Уральский федеральный округ', 'Свердловская область', 19273056, 'S9885878283', NULL, 0, '266.38', '291.00', '301.00', 899907980, 'subject_1645', 'category_03405', 'brand_4842913', NULL, '2024-06-01 05:07:46', '2024-06-01 05:07:46'),
(10, '98185899516723001122', '2024-05-30', '2024-05-30', 'a_665459598', 's_296', '8415178856325', '501.00', 40, 0, 1, NULL, 'Казань', 'Россия', 'Сибирский федеральный округ', 'Кемеровская область', 17894194, 'S9885886127', NULL, 11, '266.43', '267.00', '301.00', 239836944, 'subject_4734', 'category_03405', 'brand_6393790', NULL, '2024-06-01 05:07:46', '2024-06-01 05:07:46'),
(11, '94161351834671836123', '2024-05-30', '2024-05-30', 'a_644498460', 's_296', '0455627429446', '2633.00', 0, 0, 1, NULL, 'Электросталь', 'Россия', 'Центральный федеральный округ', 'Москва', 19536899, 'S9886071893', NULL, 9, '2330.20', '2396.00', '2633.00', 757459508, 'subject_1153', 'category_03405', 'brand_7501118', NULL, '2024-06-01 05:07:46', '2024-06-01 05:07:46'),
(12, '91945968847965594198', '2024-05-30', '2024-05-30', 'a_575598574', 's_296', '7307808192577', '790.00', 0, 0, 1, NULL, 'Казань', 'Россия', 'Сибирский федеральный округ', 'Новосибирская область', 19272807, 'S9886076256', NULL, 9, '699.15', '718.00', '790.00', 98783590, 'subject_1153', 'category_03405', 'brand_7501118', NULL, '2024-06-01 05:07:46', '2024-06-01 05:07:46'),
(13, '98289090728949192184', '2024-05-30', '2024-05-30', 'a_665459598', 's_296', '8415178856325', '501.00', 40, 0, 1, NULL, 'Электросталь', 'Россия', 'Северо-Западный федеральный округ', 'Республика Коми', 15185085, 'S9886082796', NULL, 10, '266.43', '256.00', '301.00', 239836944, 'subject_4734', 'category_03405', 'brand_6393790', NULL, '2024-06-01 05:07:46', '2024-06-01 05:07:46'),
(14, '1133350655871732027', '2024-05-30', '2024-05-30', 'a_034339447', 's_296', '9493685515868', '1888.00', 20, 0, 1, NULL, 'Электросталь', 'Россия', 'Центральный федеральный округ', 'Московская область', 20201940, 'S9886083674', NULL, 9, '1336.30', '1305.00', '1510.00', 601413913, 'subject_1153', 'category_03405', 'brand_6791887', NULL, '2024-06-01 05:07:47', '2024-06-01 05:07:47'),
(15, '8622929985756331783', '2024-05-30', '2024-05-30', 'a_665459598', 's_296', '8415178856325', '501.00', 40, 0, 1, NULL, 'Коледино', 'Россия', 'Сибирский федеральный округ', 'Новосибирская область', 17894851, 'S9886234703', NULL, 10, '266.43', '270.00', '301.00', 239836944, 'subject_4734', 'category_03405', 'brand_6393790', NULL, '2024-06-01 05:07:47', '2024-06-01 05:07:47'),
(16, '7590465313880925275', '2024-05-30', '2024-05-30', 'a_274607887', 's_296', '3437524930869', '3460.00', 0, 0, 1, NULL, 'Казань', 'Россия', 'Сибирский федеральный округ', 'Новосибирская область', 19273056, 'S9886293128', NULL, 9, '3062.10', '3148.00', '3460.00', 992061869, 'subject_7025', 'category_03405', 'brand_1943385', NULL, '2024-06-01 05:07:47', '2024-06-01 05:07:47'),
(17, '670803055791741503', '2024-05-30', '2024-05-30', 'a_607757220', 's_296', '7695667882474', '616.00', 0, 0, 1, NULL, 'Электросталь', 'Россия', 'Приволжский федеральный округ', 'Саратовская область', 19536914, 'S9886295002', NULL, 9, '545.16', '560.00', '616.00', 13443050, 'subject_1645', 'category_03405', 'brand_6791887', NULL, '2024-06-01 05:07:47', '2024-06-01 05:07:47'),
(18, '95758887437256635964', '2024-05-30', '2024-05-31', 'a_739474329', 's_296', '8986498930925', '1149.00', 0, 0, 1, NULL, 'Электросталь', 'Россия', 'Уральский федеральный округ', 'Свердловская область', 19536899, 'S9886414498', NULL, 9, '1016.86', '1045.00', '1149.00', 832084985, 'subject_1153', 'category_03405', 'brand_6791887', NULL, '2024-06-01 05:07:47', '2024-06-01 05:07:47'),
(19, '93849560656219800191', '2024-05-30', '2024-05-30', 'a_464437422', 's_296', '0939238281117', '1835.00', 20, 0, 1, NULL, 'Краснодар', 'Россия', 'Южный федеральный округ', 'Ростовская область', 20200670, 'S9886440763', NULL, 9, '1299.18', '1335.00', '1468.00', 510938784, 'subject_1153', 'category_03405', 'brand_6791887', NULL, '2024-06-01 05:07:47', '2024-06-01 05:07:47'),
(20, '92691994149904896291', '2024-05-30', '2024-05-30', 'a_665459598', 's_296', '8415178856325', '501.00', 40, 0, 1, NULL, 'Коледино', 'Россия', 'Приволжский федеральный округ', 'Пермский край', 17894851, 'S9886442942', NULL, 10, '266.43', '270.00', '301.00', 239836944, 'subject_4734', 'category_03405', 'brand_6393790', NULL, '2024-06-01 05:07:47', '2024-06-01 05:07:47'),
(21, '93252234969497812629', '2024-05-30', '2024-05-30', 'a_326766448', 's_296', '5618766540820', '7983.00', 0, 0, 1, NULL, 'Чехов 1', 'Россия', 'Южный федеральный округ', 'Ростовская область', 19256162, 'S9886449571', NULL, 9, '7064.95', '7264.00', '7983.00', 622099253, 'subject_1153', 'category_03405', 'brand_6791887', NULL, '2024-06-01 05:07:47', '2024-06-01 05:07:47'),
(22, '6010417821087081970', '2024-05-30', '2024-05-30', 'a_665459598', 's_296', '8415178856325', '501.00', 40, 0, 1, NULL, 'Коледино', 'Россия', 'Дальневосточный федеральный округ', 'Хабаровский край', 17894851, 'S9886499511', NULL, 0, '266.43', '412.00', '301.00', 239836944, 'subject_4734', 'category_03405', 'brand_6393790', NULL, '2024-06-01 05:07:47', '2024-06-01 05:07:47'),
(23, '93051797338112348613', '2024-05-30', '2024-05-30', 'a_311596847', 's_296', '7924835658819', '2759.00', 0, 0, 1, NULL, 'Электросталь', 'Россия', 'Сибирский федеральный округ', 'Красноярский край', 20201940, 'S9886585894', NULL, 10, '2441.71', '2483.00', '2759.00', 922895134, 'subject_1153', 'category_03405', 'brand_7501118', NULL, '2024-06-01 05:07:47', '2024-06-01 05:07:47'),
(24, '95416286628396752212', '2024-05-30', '2024-05-30', 'a_262258994', 's_296', '3343804767992', '1021.00', 0, 0, 1, NULL, 'Электросталь', 'Россия', 'Центральный федеральный округ', 'Московская область', 20201940, 'S9886590743', NULL, 9, '903.58', '882.00', '1021.00', 380090997, 'subject_1153', 'category_03405', 'brand_6791887', NULL, '2024-06-01 05:07:47', '2024-06-01 05:07:47'),
(25, '6021880125654789090', '2024-05-30', '2024-05-30', 'a_895964763', 's_296', '6049855848659', '1001.00', 0, 0, 1, NULL, 'Электросталь', 'Россия', 'Уральский федеральный округ', 'Тюменская область', 20201940, 'S9886639587', NULL, 10, '885.88', '855.00', '1001.00', 447705614, 'subject_8623', 'category_03405', 'brand_2096932', NULL, '2024-06-01 05:07:47', '2024-06-01 05:07:47'),
(26, '9985401712763150871', '2024-05-30', '2024-05-30', 'a_665459598', 's_296', '8415178856325', '501.00', 40, 0, 1, NULL, 'Электросталь', 'Россия', 'Сибирский федеральный округ', 'Кемеровская область', 15185085, 'S9886641836', NULL, 10, '266.43', '256.00', '301.00', 239836944, 'subject_4734', 'category_03405', 'brand_6393790', NULL, '2024-06-01 05:07:47', '2024-06-01 05:07:47'),
(27, '96329536522399563667', '2024-05-30', '2024-05-30', 'a_665459598', 's_296', '8415178856325', '501.00', 40, 0, 1, NULL, 'Электросталь', 'Россия', 'Уральский федеральный округ', 'Свердловская область', 15185085, 'S9886656883', NULL, 10, '266.43', '256.00', '301.00', 239836944, 'subject_4734', 'category_03405', 'brand_6393790', NULL, '2024-06-01 05:07:47', '2024-06-01 05:07:47'),
(28, '2130927717479276812', '2024-05-30', '2024-05-30', 'a_231134785', 's_296', '5442172245043', '2363.00', 0, 0, 1, NULL, 'Казань', 'Россия', 'Уральский федеральный округ', 'Тюменская область', 14740467, 'S9886684261', NULL, 9, '2091.25', '2150.00', '2363.00', 853696294, 'subject_3082', 'category_03405', 'brand_1943385', NULL, '2024-06-01 05:07:47', '2024-06-01 05:07:47'),
(29, '91239246133177110602', '2024-05-30', '2024-05-30', 'a_270717918', 's_296', '4886197766357', '441.00', 0, 0, 1, NULL, 'Электросталь', 'Россия', 'Центральный федеральный округ', 'Тульская область', 18552715, 'S9886699832', NULL, 0, '390.28', '418.00', '441.00', 32627376, 'subject_1645', 'category_03405', 'brand_4842913', NULL, '2024-06-01 05:07:47', '2024-06-01 05:07:47'),
(30, '9130296663513929617', '2024-05-30', '2024-05-30', 'a_206004302', 's_296', '0070448162631', '805.00', 0, 0, 1, NULL, 'Электросталь', 'Россия', 'Сибирский федеральный округ', 'Красноярский край', 19536899, 'S9886744954', NULL, 10, '712.42', '687.00', '805.00', 982315624, 'subject_1153', 'category_03405', 'brand_7501118', NULL, '2024-06-01 05:07:47', '2024-06-01 05:07:47'),
(31, '96969395289967049548', '2024-05-30', '2024-05-30', 'a_462452710', 's_296', '8214933767622', '2245.00', 0, 0, 1, NULL, 'Краснодар', 'Россия', 'Северо-Кавказский федеральный округ', 'Республика Северная Осетия — Алания', 18901225, 'S9886833273', NULL, 9, '1986.82', '1939.00', '2245.00', 993464938, 'subject_4061', 'category_03405', 'brand_9449861', NULL, '2024-06-01 05:07:48', '2024-06-01 05:07:48'),
(32, '94690227939873391931', '2024-05-30', '2024-05-30', 'a_255513187', 's_296', '2866862836022', '2096.00', 0, 0, 1, NULL, 'Электросталь', 'Россия', 'Северо-Западный федеральный округ', 'Ленинградская область', 20201940, 'S9886924022', NULL, 9, '1854.96', '1907.00', '2096.00', 279645985, 'subject_1153', 'category_03405', 'brand_7501118', NULL, '2024-06-01 05:07:48', '2024-06-01 05:07:48'),
(33, '91263450287696996769', '2024-05-30', '2024-05-30', 'a_712147434', 's_296', '4762230925838', '2129.00', 0, 0, 1, NULL, 'Казань', 'Россия', 'Северо-Кавказский федеральный округ', 'Ставропольский край', 14502832, 'S9887019229', NULL, 9, '1884.16', '1937.00', '2129.00', 926027034, 'subject_3082', 'category_03405', 'brand_1943385', NULL, '2024-06-01 05:07:48', '2024-06-01 05:07:48'),
(34, '7715394058509780321', '2024-05-30', '2024-05-30', 'a_206004302', 's_296', '0070448162631', '805.00', 0, 0, 1, NULL, 'Электросталь', 'Россия', 'Уральский федеральный округ', 'Свердловская область', 19536899, 'S9887053495', NULL, 9, '712.42', '695.00', '805.00', 982315624, 'subject_1153', 'category_03405', 'brand_7501118', NULL, '2024-06-01 05:07:48', '2024-06-01 05:07:48'),
(35, '7527500904992757148', '2024-05-30', '2024-05-30', 'a_712147434', 's_296', '4762230925838', '2129.00', 0, 0, 1, NULL, 'Казань', 'Россия', 'Центральный федеральный округ', 'Липецкая область', 14502832, 'S9887067861', NULL, 9, '1884.16', '1937.00', '2129.00', 926027034, 'subject_3082', 'category_03405', 'brand_1943385', NULL, '2024-06-01 05:07:48', '2024-06-01 05:07:48'),
(36, '7527500904992757148', '2024-05-30', '2024-05-30', 'a_712147434', 's_296', '4762230925838', '2129.00', 0, 0, 1, NULL, 'Казань', 'Россия', 'Центральный федеральный округ', 'Липецкая область', 14502832, 'S9887067862', NULL, 9, '1884.16', '1937.00', '2129.00', 926027034, 'subject_3082', 'category_03405', 'brand_1943385', NULL, '2024-06-01 05:07:48', '2024-06-01 05:07:48'),
(37, '92683538570609238918', '2024-05-30', '2024-05-30', 'a_262258994', 's_296', '3343804767992', '1021.00', 0, 0, 1, NULL, 'Электросталь', 'Россия', 'Приволжский федеральный округ', 'Удмуртская Республика', 20201940, 'S9887159443', NULL, 9, '903.58', '882.00', '1021.00', 380090997, 'subject_1153', 'category_03405', 'brand_6791887', NULL, '2024-06-01 05:07:48', '2024-06-01 05:07:48'),
(38, '3406486882745654528', '2024-05-30', '2024-05-30', 'a_862828954', 's_296', '6898521207045', '838.00', 0, 0, 1, NULL, 'Казань', 'Россия', 'Дальневосточный федеральный округ', 'Хабаровский край', 15167964, 'S9887167888', NULL, 5, '741.63', '793.00', '838.00', 822235188, 'subject_1645', 'category_03405', 'brand_4842913', NULL, '2024-06-01 05:07:48', '2024-06-01 05:07:48'),
(39, '93510481180022161279', '2024-05-30', '2024-05-30', 'a_310373674', 's_296', '7551540966369', '2326.00', 0, 0, 1, NULL, 'Чехов 2', 'Россия', 'Приволжский федеральный округ', 'Оренбургская область', 15030829, 'S9887306175', NULL, 9, '2058.51', '2010.00', '2326.00', 236810358, 'subject_1153', 'category_03405', 'brand_7501118', NULL, '2024-06-01 05:07:48', '2024-06-01 05:07:48'),
(40, '6430868215897593404', '2024-05-30', '2024-05-30', 'a_665459598', 's_296', '8415178856325', '501.00', 40, 0, 1, NULL, 'Коледино', 'Россия', 'Центральный федеральный округ', 'Белгородская область', 17894851, 'S9887314006', NULL, 10, '266.43', '256.00', '301.00', 239836944, 'subject_4734', 'category_03405', 'brand_6393790', NULL, '2024-06-01 05:07:48', '2024-06-01 05:07:48'),
(41, '138589229779556309', '2024-05-30', '2024-05-30', 'a_457860440', 's_296', '9599826594827', '855.00', 0, 0, 1, NULL, 'Чехов 2', 'Россия', 'Центральный федеральный округ', 'Москва', 18635002, 'S9887404118', NULL, 9, '756.67', '778.00', '855.00', 52585563, 'subject_1153', 'category_03405', 'brand_6791887', NULL, '2024-06-01 05:07:48', '2024-06-01 05:07:48'),
(42, '30062628243015699', '2024-05-30', '2024-05-30', 'a_083834457', 's_296', '6245259554078', '362.00', 0, 0, 1, NULL, 'Электросталь', 'Россия', 'Центральный федеральный округ', 'Московская область', 19536914, 'S9887411649', NULL, 0, '320.37', '343.00', '362.00', 908073440, 'subject_0229', 'category_03405', 'brand_1943385', NULL, '2024-06-01 05:07:48', '2024-06-01 05:07:48'),
(43, '92621447721831177847', '2024-05-30', '2024-05-30', 'a_607757220', 's_296', '7695667882474', '616.00', 0, 0, 1, NULL, 'Электросталь', 'Россия', 'Приволжский федеральный округ', 'Нижегородская область', 19536914, 'S9887495001', NULL, 9, '545.16', '532.00', '616.00', 13443050, 'subject_1645', 'category_03405', 'brand_6791887', NULL, '2024-06-01 05:07:48', '2024-06-01 05:07:48'),
(44, '98064121220729457523', '2024-05-30', '2024-05-30', 'a_083834457', 's_296', '6245259554078', '362.00', 0, 0, 1, NULL, 'Электросталь', 'Россия', 'Южный федеральный округ', 'Краснодарский край', 19536914, 'S9887644428', NULL, 0, '320.37', '343.00', '362.00', 908073440, 'subject_0229', 'category_03405', 'brand_1943385', NULL, '2024-06-01 05:07:48', '2024-06-01 05:07:48'),
(45, '4733976584807851154', '2024-05-30', '2024-05-30', 'a_548829511', 's_296', '4111107680107', '6617.00', 0, 0, 1, NULL, 'Екатеринбург - Испытателей 14г', 'Россия', 'Сибирский федеральный округ', 'Томская область', 18211742, 'S9887904040', NULL, 9, '5856.04', '6021.00', '6617.00', 618998808, 'subject_7025', 'category_03405', 'brand_1943385', NULL, '2024-06-01 05:07:48', '2024-06-01 05:07:48'),
(46, '98937174284412882242', '2024-05-30', '2024-05-30', 'a_949551420', 's_296', '0208889848275', '1676.00', 0, 0, 1, NULL, 'Электросталь', 'Россия', 'Северо-Западный федеральный округ', 'Калининградская область', 19536899, 'S9887911858', NULL, 1, '1483.26', '1661.00', '1676.00', 828668392, 'subject_1153', 'category_03405', 'brand_6791887', NULL, '2024-06-01 05:07:48', '2024-06-01 05:07:48'),
(47, '94510741975143984333', '2024-05-30', '2024-05-30', 'a_200526896', 's_296', '7546276519753', '371.00', 0, 0, 1, NULL, 'Электросталь', 'Россия', 'Северо-Кавказский федеральный округ', 'Ставропольский край', 18901099, 'S9888021707', NULL, 0, '328.33', '352.00', '371.00', 348842457, 'subject_1645', 'category_03405', 'brand_4842913', NULL, '2024-06-01 05:07:48', '2024-06-01 05:07:48'),
(48, '7986136399232466080', '2024-05-30', '2024-05-30', 'a_295755025', 's_296', '6345980147877', '1500.00', 20, 0, 1, NULL, 'Электросталь', 'Россия', 'Центральный федеральный округ', 'Владимирская область', 19536914, 'S9888036787', NULL, 9, '1062.00', '1037.00', '1200.00', 348022198, 'subject_1645', 'category_03405', 'brand_6791887', NULL, '2024-06-01 05:07:48', '2024-06-01 05:07:48'),
(49, '96140514585646029721', '2024-05-30', '2024-05-30', 'a_665459598', 's_296', '8415178856325', '501.00', 40, 0, 1, NULL, 'Коледино', 'Россия', 'Центральный федеральный округ', 'Калужская область', 17894851, 'S9888093438', NULL, 10, '266.43', '256.00', '301.00', 239836944, 'subject_4734', 'category_03405', 'brand_6393790', NULL, '2024-06-01 05:07:48', '2024-06-01 05:07:48'),
(50, '94038524763056534194', '2024-05-30', '2024-05-30', 'a_939941307', 's_296', '5242671265788', '307.00', 0, 0, 1, NULL, 'Казань', 'Россия', 'Приволжский федеральный округ', 'Самарская область', 19273056, 'S9888186034', NULL, 0, '271.69', '291.00', '307.00', 899907980, 'subject_1645', 'category_03405', 'brand_4842913', NULL, '2024-06-01 05:07:49', '2024-06-01 05:07:49'),
(51, '1270322023307498270', '2024-05-30', '2024-05-30', 'a_895964763', 's_296', '6049855848659', '1300.00', 20, 0, 1, NULL, 'Казань', 'Россия', 'Уральский федеральный округ', 'Челябинская область', 20202500, 'S9888586904', NULL, 9, '920.40', '946.00', '1040.00', 447705614, 'subject_8623', 'category_03405', 'brand_2096932', NULL, '2024-06-01 05:07:49', '2024-06-01 05:07:49'),
(52, '1323744909510245222', '2024-05-30', '2024-05-30', 'a_336977266', 's_296', '9726525951508', '1073.00', 0, 0, 1, NULL, 'Электросталь', 'Россия', 'Северо-Западный федеральный округ', 'Республика Карелия', 20201940, 'S9888591390', NULL, 10, '949.60', '965.00', '1073.00', 75392953, 'subject_1153', 'category_03405', 'brand_6791887', NULL, '2024-06-01 05:07:49', '2024-06-01 05:07:49'),
(53, '93209305460604238318', '2024-05-30', '2024-05-30', 'a_231134785', 's_296', '5442172245043', '2363.00', 0, 0, 1, NULL, 'Электросталь', 'Россия', 'Центральный федеральный округ', 'Москва', 14231604, 'S9888594703', NULL, 9, '2091.25', '2150.00', '2363.00', 853696294, 'subject_3082', 'category_03405', 'brand_1943385', NULL, '2024-06-01 05:07:49', '2024-06-01 05:07:49'),
(54, '5793959176175741980', '2024-05-30', '2024-05-30', 'a_862828954', 's_296', '6898521207045', '808.00', 0, 0, 1, NULL, 'Краснодар', 'Россия', 'Южный федеральный округ', 'Ростовская область', 17894215, 'S9888681482', NULL, 9, '715.08', '735.00', '808.00', 822235188, 'subject_1645', 'category_03405', 'brand_4842913', NULL, '2024-06-01 05:07:49', '2024-06-01 05:07:49'),
(55, '8116508219328683182', '2024-05-30', '2024-05-30', 'a_939941307', 's_296', '5242671265788', '307.00', 0, 0, 1, NULL, 'Электросталь', 'Россия', 'Центральный федеральный округ', 'Курская область', 19536914, 'S9888935363', NULL, 0, '271.69', '307.00', '307.00', 899907980, 'subject_1645', 'category_03405', 'brand_4842913', NULL, '2024-06-01 05:07:49', '2024-06-01 05:07:49'),
(56, '96615059994533947307', '2024-05-30', '2024-05-30', 'a_270717918', 's_296', '4886197766357', '552.00', 20, 0, 1, NULL, 'Казань', 'Россия', 'Приволжский федеральный округ', 'Республика Татарстан', 16031182, 'S9889001417', NULL, 0, '391.22', '418.00', '442.00', 32627376, 'subject_1645', 'category_03405', 'brand_4842913', NULL, '2024-06-01 05:07:49', '2024-06-01 05:07:49'),
(57, '96829866332775693283', '2024-05-30', '2024-05-30', 'a_665459598', 's_296', '8415178856325', '501.00', 40, 0, 1, NULL, 'Коледино', 'Россия', 'Приволжский федеральный округ', 'Пермский край', 17894851, 'S9889061664', NULL, 9, '266.43', '259.00', '301.00', 239836944, 'subject_4734', 'category_03405', 'brand_6393790', NULL, '2024-06-01 05:07:49', '2024-06-01 05:07:49'),
(58, '4777997401963649383', '2024-05-30', '2024-05-30', 'a_642817957', 's_296', '2166549609625', '1215.00', 20, 0, 1, NULL, 'Электросталь', 'Россия', 'Центральный федеральный округ', 'Ивановская область', 19536899, 'S9889087371', NULL, 9, '860.22', '839.00', '972.00', 81583115, 'subject_1153', 'category_03405', 'brand_6791887', NULL, '2024-06-01 05:07:49', '2024-06-01 05:07:49'),
(59, '164903994368209172', '2024-05-30', '2024-05-30', 'a_862828954', 's_296', '6898521207045', '817.00', 0, 0, 1, NULL, 'Казань', 'Россия', 'Дальневосточный федеральный округ', 'Республика Бурятия', 19273056, 'S9889312322', NULL, 4, '723.04', '748.00', '817.00', 822235188, 'subject_1645', 'category_03405', 'brand_4842913', NULL, '2024-06-01 05:07:49', '2024-06-01 05:07:49'),
(60, '1539712475189322303', '2024-05-30', '2024-05-30', 'a_607757220', 's_296', '7695667882474', '616.00', 0, 0, 1, NULL, 'Электросталь', 'Россия', 'Центральный федеральный округ', 'Москва', 19536914, 'S9889367784', NULL, 9, '545.16', '560.00', '616.00', 13443050, 'subject_1645', 'category_03405', 'brand_6791887', NULL, '2024-06-01 05:07:49', '2024-06-01 05:07:49'),
(61, '5839616961487574925', '2024-05-30', '2024-05-30', 'a_262258994', 's_296', '3343804767992', '1021.00', 0, 0, 1, NULL, 'Электросталь', 'Россия', 'Центральный федеральный округ', 'Москва', 20201940, 'S9889469777', NULL, 9, '903.58', '929.00', '1021.00', 380090997, 'subject_1153', 'category_03405', 'brand_6791887', NULL, '2024-06-01 05:07:49', '2024-06-01 05:07:49'),
(62, '96225608122722062273', '2024-05-30', '2024-05-30', 'a_665459598', 's_296', '8415178856325', '501.00', 40, 0, 1, NULL, 'Коледино', 'Россия', 'Сибирский федеральный округ', 'Кемеровская область', 17894851, 'S9889485390', NULL, 10, '266.43', '256.00', '301.00', 239836944, 'subject_4734', 'category_03405', 'brand_6393790', NULL, '2024-06-01 05:07:49', '2024-06-01 05:07:49'),
(63, '96855927070511452494', '2024-05-30', '2024-05-30', 'a_326224204', 's_296', '6805580460421', '5729.00', 0, 0, 1, NULL, 'Электросталь', 'Россия', 'Северо-Западный федеральный округ', 'Санкт-Петербург', 17562739, 'S9889570633', NULL, 9, '5070.16', '5213.00', '5729.00', 27513264, 'subject_3405', 'category_03405', 'brand_5192677', NULL, '2024-06-01 05:07:49', '2024-06-01 05:07:49'),
(64, '97076576861070137521', '2024-05-30', '2024-05-30', 'a_850252225', 's_296', '9496565652095', '942.00', 0, 0, 1, NULL, 'Новосибирск', 'Россия', 'Приволжский федеральный округ', 'Самарская область', 18212727, 'S9889644800', NULL, 9, '833.67', '814.00', '942.00', 227685177, 'subject_0229', 'category_03405', 'brand_1943385', NULL, '2024-06-01 05:07:49', '2024-06-01 05:07:49'),
(65, '95195433381993356272', '2024-05-30', '2024-05-30', 'a_665459598', 's_296', '8415178856325', '501.00', 40, 0, 1, NULL, 'Коледино', 'Россия', 'Сибирский федеральный округ', 'Красноярский край', 17894851, 'S9889684672', NULL, 10, '266.43', '256.00', '301.00', 239836944, 'subject_4734', 'category_03405', 'brand_6393790', NULL, '2024-06-01 05:07:49', '2024-06-01 05:07:49'),
(66, '95195433381993356272', '2024-05-30', '2024-05-30', 'a_665459598', 's_296', '8415178856325', '501.00', 40, 0, 1, NULL, 'Коледино', 'Россия', 'Сибирский федеральный округ', 'Красноярский край', 17894851, 'S9889684673', NULL, 10, '266.43', '256.00', '301.00', 239836944, 'subject_4734', 'category_03405', 'brand_6393790', NULL, '2024-06-01 05:07:49', '2024-06-01 05:07:49'),
(67, '95195433381993356272', '2024-05-30', '2024-05-30', 'a_665459598', 's_296', '8415178856325', '501.00', 40, 0, 1, NULL, 'Коледино', 'Россия', 'Сибирский федеральный округ', 'Красноярский край', 17894851, 'S9889684674', NULL, 10, '266.43', '256.00', '301.00', 239836944, 'subject_4734', 'category_03405', 'brand_6393790', NULL, '2024-06-01 05:07:49', '2024-06-01 05:07:49'),
(68, '4362397323798360822', '2024-05-30', '2024-05-30', 'a_807756089', 's_296', '0773093846744', '1611.00', 0, 0, 1, NULL, 'Электросталь', 'Россия', 'Сибирский федеральный округ', 'Республика Хакасия', 19536899, 'S9889830205', NULL, 10, '1425.73', '1449.00', '1611.00', 879799252, 'subject_8623', 'category_03405', 'brand_2096932', NULL, '2024-06-01 05:07:49', '2024-06-01 05:07:49'),
(69, '9156180250537449365', '2024-05-30', '2024-05-30', 'a_644498460', 's_296', '0455627429446', '2633.00', 0, 0, 1, NULL, 'Электросталь', 'Россия', 'Центральный федеральный округ', 'Рязанская область', 19536899, 'S9889908274', NULL, 9, '2330.20', '2396.00', '2633.00', 757459508, 'subject_1153', 'category_03405', 'brand_7501118', NULL, '2024-06-01 05:07:49', '2024-06-01 05:07:49'),
(70, '7999465832049737045', '2024-05-30', '2024-05-30', 'a_939941307', 's_296', '5242671265788', '307.00', 0, 0, 1, NULL, 'Электросталь', 'Россия', 'Северо-Западный федеральный округ', 'Ленинградская область', 19536914, 'S9889983254', NULL, 0, '271.69', '291.00', '307.00', 899907980, 'subject_1645', 'category_03405', 'brand_4842913', NULL, '2024-06-01 05:07:50', '2024-06-01 05:07:50'),
(71, '476159770677097489', '2024-05-30', '2024-05-30', 'a_223493109', 's_296', '2324950870110', '584.00', 0, 0, 1, NULL, 'Краснодар', 'Россия', 'Южный федеральный округ', 'Краснодарский край', 20200670, 'S9889993962', NULL, 9, '516.84', '531.00', '584.00', 143224180, 'subject_1153', 'category_03405', 'brand_6791887', NULL, '2024-06-01 05:07:50', '2024-06-01 05:07:50'),
(72, '6620259325471575639', '2024-05-30', '2024-05-30', 'a_631406264', 's_296', '4666591544853', '2283.00', 0, 0, 1, NULL, 'Электросталь', 'Россия', 'Северо-Западный федеральный округ', 'Санкт-Петербург', 17245070, 'S9890233745', NULL, 9, '2020.45', '1973.00', '2283.00', 120301206, 'subject_1153', 'category_03405', 'brand_7501118', NULL, '2024-06-01 05:07:50', '2024-06-01 05:07:50'),
(73, '92246965282675293934', '2024-05-30', '2024-05-30', 'a_665459598', 's_296', '8415178856325', '501.00', 40, 0, 1, NULL, 'Электросталь', 'Россия', 'Сибирский федеральный округ', 'Красноярский край', 15185085, 'S9890385710', NULL, 10, '266.43', '270.00', '301.00', 239836944, 'subject_4734', 'category_03405', 'brand_6393790', NULL, '2024-06-01 05:07:50', '2024-06-01 05:07:50'),
(74, '91430398375383508683', '2024-05-30', '2024-05-30', 'a_665459598', 's_296', '8415178856325', '501.00', 40, 0, 1, NULL, 'Электросталь', 'Россия', 'Сибирский федеральный округ', 'Красноярский край', 15185085, 'S9890385711', NULL, 10, '266.43', '270.00', '301.00', 239836944, 'subject_4734', 'category_03405', 'brand_6393790', NULL, '2024-06-01 05:07:50', '2024-06-01 05:07:50'),
(75, '422340432817034741', '2024-05-30', '2024-05-30', 'a_200526896', 's_296', '7546276519753', '371.00', 0, 0, 1, NULL, 'Электросталь', 'Россия', 'Центральный федеральный округ', 'Брянская область', 18901099, 'S9890498617', NULL, 0, '328.33', '371.00', '371.00', 348842457, 'subject_1645', 'category_03405', 'brand_4842913', NULL, '2024-06-01 05:07:50', '2024-06-01 05:07:50'),
(76, '95862486387650005929', '2024-05-30', '2024-05-30', 'a_206004302', 's_296', '0070448162631', '805.00', 0, 0, 1, NULL, 'Электросталь', 'Россия', 'Сибирский федеральный округ', 'Красноярский край', 19536899, 'S9890755030', NULL, 10, '712.42', '687.00', '805.00', 982315624, 'subject_1153', 'category_03405', 'brand_7501118', NULL, '2024-06-01 05:07:50', '2024-06-01 05:07:50'),
(77, '5926709550864573484', '2024-05-30', '2024-05-30', 'a_862828954', 's_296', '6898521207045', '808.00', 0, 0, 1, NULL, 'Электросталь', 'Россия', 'Центральный федеральный округ', 'Тверская область', 19536914, 'S9890890192', NULL, 9, '715.08', '698.00', '808.00', 822235188, 'subject_1645', 'category_03405', 'brand_4842913', NULL, '2024-06-01 05:07:50', '2024-06-01 05:07:50'),
(78, '902694024546101876', '2024-05-30', '2024-05-30', 'a_238684049', 's_296', '5535268749507', '2544.00', 0, 0, 1, NULL, 'Электросталь', 'Россия', 'Уральский федеральный округ', 'Челябинская область', 20201940, 'S9891063270', NULL, 9, '2251.44', '2199.00', '2544.00', 83950218, 'subject_2968', 'category_03405', 'brand_7501118', NULL, '2024-06-01 05:07:50', '2024-06-01 05:07:50'),
(79, '95598586988827255111', '2024-05-30', '2024-05-30', 'a_255513187', 's_296', '2866862836022', '2096.00', 0, 0, 1, NULL, 'Обухово 2', 'Россия', 'Приволжский федеральный округ', 'Пермский край', 18552964, 'S9891148986', NULL, 9, '1854.96', '1907.00', '2096.00', 279645985, 'subject_1153', 'category_03405', 'brand_7501118', NULL, '2024-06-01 05:07:50', '2024-06-01 05:07:50'),
(80, '4129715305267239701', '2024-05-30', '2024-05-30', 'a_862828954', 's_296', '6898521207045', '808.00', 0, 0, 1, NULL, 'Краснодар', 'Россия', 'Южный федеральный округ', 'Ростовская область', 17894215, 'S9891224414', NULL, 9, '715.08', '698.00', '808.00', 822235188, 'subject_1645', 'category_03405', 'brand_4842913', NULL, '2024-06-01 05:07:50', '2024-06-01 05:07:50'),
(81, '97116398649771828205', '2024-05-30', '2024-05-30', 'a_457860440', 's_296', '9599826594827', '995.00', 20, 0, 1, NULL, 'Чехов 2', 'Россия', 'Центральный федеральный округ', 'Москва', 18635002, 'S9891269948', NULL, 9, '704.46', '724.00', '796.00', 52585563, 'subject_1153', 'category_03405', 'brand_6791887', NULL, '2024-06-01 05:07:50', '2024-06-01 05:07:50'),
(82, '7696439133720015748', '2024-05-30', '2024-05-30', 'a_869716371', 's_296', '7359142112549', '2532.00', 0, 0, 1, NULL, 'Казань', 'Россия', 'Уральский федеральный округ', 'Свердловская область', 14502832, 'S9891288327', NULL, 9, '2240.82', '2188.00', '2532.00', 132691484, 'subject_3082', 'category_03405', 'brand_1943385', NULL, '2024-06-01 05:07:50', '2024-06-01 05:07:50'),
(83, '91593030059443296431', '2024-05-30', '2024-05-30', 'a_665459598', 's_296', '8415178856325', '501.00', 40, 0, 1, NULL, 'Коледино', 'Россия', 'Сибирский федеральный округ', 'Кемеровская область', 17894851, 'S9891319461', NULL, 10, '266.43', '256.00', '301.00', 239836944, 'subject_4734', 'category_03405', 'brand_6393790', NULL, '2024-06-01 05:07:50', '2024-06-01 05:07:50'),
(84, '93221412664463231807', '2024-05-30', '2024-05-30', 'a_977483833', 's_296', '2402923989235', '1471.00', 0, 0, 1, NULL, 'Электросталь', 'Россия', 'Центральный федеральный округ', 'Московская область', 18552715, 'S9891322121', NULL, 9, '1301.83', '1338.00', '1471.00', 821178924, 'subject_0229', 'category_03405', 'brand_1943385', NULL, '2024-06-01 05:07:50', '2024-06-01 05:07:50'),
(85, '93221412664463231807', '2024-05-30', '2024-05-30', 'a_977483833', 's_296', '2402923989235', '1471.00', 0, 0, 1, NULL, 'Электросталь', 'Россия', 'Центральный федеральный округ', 'Московская область', 18901099, 'S9891328542', NULL, 9, '1301.83', '1338.00', '1471.00', 821178924, 'subject_0229', 'category_03405', 'brand_1943385', NULL, '2024-06-01 05:07:50', '2024-06-01 05:07:50'),
(86, '6962906436899450621', '2024-05-30', '2024-05-30', 'a_862828954', 's_296', '6898521207045', '808.00', 0, 0, 1, NULL, 'Электросталь', 'Россия', 'Центральный федеральный округ', 'Московская область', 19536914, 'S9891372350', NULL, 9, '715.08', '698.00', '808.00', 822235188, 'subject_1645', 'category_03405', 'brand_4842913', NULL, '2024-06-01 05:07:50', '2024-06-01 05:07:50'),
(87, '97153183888796546073', '2024-05-30', '2024-05-30', 'a_276829861', 's_296', '5736370179572', '610.00', 0, 0, 1, NULL, 'Коледино', 'Беларусь', '', 'Минская область', 17562724, 'S9891387485', NULL, 9, '548.26', '562.58', '618.41', 954188640, 'subject_3171', 'category_03405', 'brand_1943385', NULL, '2024-06-01 05:07:50', '2024-06-01 05:07:50'),
(88, '97770633173770067776', '2024-05-30', '2024-05-30', 'a_223493109', 's_296', '2324950870110', '683.00', 24, 0, 1, NULL, 'Краснодар', 'Россия', 'Южный федеральный округ', 'Краснодарский край', 20200670, 'S9891429685', NULL, 9, '459.31', '448.00', '519.00', 143224180, 'subject_1153', 'category_03405', 'brand_6791887', NULL, '2024-06-01 05:07:50', '2024-06-01 05:07:50'),
(89, '95914385365928368641', '2024-05-30', '2024-05-30', 'a_644498460', 's_296', '0455627429446', '2633.00', 0, 0, 1, NULL, 'Электросталь', 'Россия', 'Северо-Западный федеральный округ', 'Санкт-Петербург', 19536899, 'S9891512846', NULL, 9, '2330.20', '2396.00', '2633.00', 757459508, 'subject_1153', 'category_03405', 'brand_7501118', NULL, '2024-06-01 05:07:50', '2024-06-01 05:07:50'),
(90, '9957270727522759728', '2024-05-30', '2024-05-30', 'a_362671669', 's_296', '3141473083083', '2460.00', 0, 0, 1, NULL, 'Казань', 'Россия', 'Сибирский федеральный округ', 'Омская область', 14740467, 'S9891555431', NULL, 9, '2177.10', '2126.00', '2460.00', 472557830, 'subject_3082', 'category_03405', 'brand_1943385', NULL, '2024-06-01 05:07:51', '2024-06-01 05:07:51'),
(91, '1216407565670597989', '2024-05-30', '2024-05-30', 'a_665459598', 's_296', '8415178856325', '501.00', 40, 0, 1, NULL, 'Коледино', 'Россия', 'Южный федеральный округ', 'Краснодарский край', 17894851, 'S9891597626', NULL, 10, '266.43', '270.00', '301.00', 239836944, 'subject_4734', 'category_03405', 'brand_6393790', NULL, '2024-06-01 05:07:51', '2024-06-01 05:07:51'),
(92, '4789845702365246502', '2024-05-30', '2024-05-30', 'a_352869981', 's_296', '1086691746327', '595.00', 20, 0, 1, NULL, 'Электросталь', 'Россия', 'Центральный федеральный округ', 'Москва', 20201940, 'S9891621609', NULL, 0, '421.26', '452.00', '476.00', 4579132, 'subject_1153', 'category_03405', 'brand_6791887', NULL, '2024-06-01 05:07:51', '2024-06-01 05:07:51'),
(93, '9424492003284433737', '2024-05-30', '2024-05-30', 'a_270717918', 's_296', '4886197766357', '441.00', 0, 0, 1, NULL, 'Казань', 'Россия', 'Уральский федеральный округ', 'Ханты-Мансийский автономный округ', 16031182, 'S9891667069', NULL, 0, '390.28', '418.00', '441.00', 32627376, 'subject_1645', 'category_03405', 'brand_4842913', NULL, '2024-06-01 05:07:51', '2024-06-01 05:07:51'),
(94, '2652756966886363992', '2024-05-30', '2024-05-30', 'a_202902843', 's_296', '5861021615024', '2576.00', 0, 0, 1, NULL, 'Электросталь', 'Россия', 'Центральный федеральный округ', 'Москва', 14502820, 'S9891667666', NULL, 9, '2279.76', '2226.00', '2576.00', 278608376, 'subject_7025', 'category_03405', 'brand_2425706', NULL, '2024-06-01 05:07:51', '2024-06-01 05:07:51'),
(95, '474880358423611482', '2024-05-30', '2024-05-30', 'a_665459598', 's_296', '8415178856325', '501.00', 40, 0, 1, NULL, 'Электросталь', 'Россия', 'Приволжский федеральный округ', 'Республика Татарстан', 15185085, 'S9891705022', NULL, 10, '266.43', '256.00', '301.00', 239836944, 'subject_4734', 'category_03405', 'brand_6393790', NULL, '2024-06-01 05:07:51', '2024-06-01 05:07:51'),
(96, '1808628267513848965', '2024-05-30', '2024-05-30', 'a_665459598', 's_296', '8415178856325', '501.00', 40, 0, 1, NULL, 'Казань', 'Россия', 'Приволжский федеральный округ', 'Республика Татарстан', 17894194, 'S9891705023', NULL, 0, '266.43', '285.00', '301.00', 239836944, 'subject_4734', 'category_03405', 'brand_6393790', NULL, '2024-06-01 05:07:51', '2024-06-01 05:07:51'),
(97, '92926386627964055224', '2024-05-30', '2024-05-30', 'a_665459598', 's_296', '8415178856325', '501.00', 40, 0, 1, NULL, 'Электросталь', 'Россия', 'Сибирский федеральный округ', 'Иркутская область', 15185085, 'S9891801363', NULL, 10, '266.43', '256.00', '301.00', 239836944, 'subject_4734', 'category_03405', 'brand_6393790', NULL, '2024-06-01 05:07:51', '2024-06-01 05:07:51'),
(98, '9185417858108416688', '2024-05-30', '2024-05-30', 'a_858269517', 's_296', '8248672656899', '1326.00', 0, 0, 1, NULL, 'Краснодар', 'Россия', 'Южный федеральный округ', 'Краснодарский край', 20200670, 'S9891834579', NULL, 10, '1173.51', '1193.00', '1326.00', 453316100, 'subject_1153', 'category_03405', 'brand_6791887', NULL, '2024-06-01 05:07:51', '2024-06-01 05:07:51'),
(99, '6195332582781972111', '2024-05-30', '2024-05-30', 'a_147484927', 's_296', '8593570771817', '2552.00', 0, 0, 1, NULL, 'Казань', 'Россия', 'Уральский федеральный округ', 'Ханты-Мансийский автономный округ', 17894119, 'S9891863482', NULL, 10, '2258.52', '2181.00', '2552.00', 717535240, 'subject_1153', 'category_03405', 'brand_7501118', NULL, '2024-06-01 05:07:51', '2024-06-01 05:07:51'),
(100, '9183021712497693375', '2024-05-30', '2024-05-30', 'a_282770624', 's_296', '5744961278837', '1109.00', 0, 0, 1, NULL, 'Электросталь', 'Россия', 'Уральский федеральный округ', 'Свердловская область', 20201940, 'S9891933714', NULL, 10, '981.46', '998.00', '1109.00', 103110673, 'subject_1153', 'category_03405', 'brand_6791887', NULL, '2024-06-01 05:07:51', '2024-06-01 05:07:51');

-- --------------------------------------------------------

--
-- Структура таблицы `stocks`
--

CREATE TABLE `stocks` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `date` date NOT NULL,
  `last_change_date` date NOT NULL,
  `supplier_article` varchar(191) COLLATE utf8mb4_unicode_ci NOT NULL,
  `tech_size` varchar(191) COLLATE utf8mb4_unicode_ci NOT NULL,
  `barcode` varchar(191) COLLATE utf8mb4_unicode_ci NOT NULL,
  `quantity` int(11) NOT NULL,
  `is_supply` tinyint(1) NOT NULL,
  `is_realization` tinyint(1) NOT NULL,
  `quantity_full` int(11) NOT NULL,
  `warehouse_name` varchar(191) COLLATE utf8mb4_unicode_ci NOT NULL,
  `in_way_to_client` int(11) NOT NULL,
  `in_way_from_client` int(11) NOT NULL,
  `nm_id` int(11) NOT NULL,
  `subject` varchar(191) COLLATE utf8mb4_unicode_ci NOT NULL,
  `category` varchar(191) COLLATE utf8mb4_unicode_ci NOT NULL,
  `brand` varchar(191) COLLATE utf8mb4_unicode_ci NOT NULL,
  `sc_code` varchar(191) COLLATE utf8mb4_unicode_ci NOT NULL,
  `price` int(11) NOT NULL,
  `discount` int(11) NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Дамп данных таблицы `stocks`
--

INSERT INTO `stocks` (`id`, `date`, `last_change_date`, `supplier_article`, `tech_size`, `barcode`, `quantity`, `is_supply`, `is_realization`, `quantity_full`, `warehouse_name`, `in_way_to_client`, `in_way_from_client`, `nm_id`, `subject`, `category`, `brand`, `sc_code`, `price`, `discount`, `created_at`, `updated_at`) VALUES
(1, '2024-06-01', '2023-06-30', 'a_088024901', 's_296', '9966124668817', 0, 0, 1, 1, 'Новосибирск', 1, 0, 196574206, 'subject_7025', 'category_03405', 'brand_1943385', '2666-0041', 2234, 15, '2024-06-01 08:53:44', '2024-06-01 08:53:44'),
(2, '2024-06-01', '2023-06-30', 'a_084227792', 's_296', '7065468612067', 0, 0, 1, 1, 'Подольск', 0, 1, 336356514, 'subject_0229', 'category_03405', 'brand_1943385', '2666-0041', 676, 15, '2024-06-01 08:53:45', '2024-06-01 08:53:45'),
(3, '2024-06-01', '2023-06-30', 'a_128466522', 's_296', '1251350484303', 0, 0, 1, 1, 'Белая дача', 0, 1, 122996701, 'subject_7025', 'category_03405', 'brand_1943385', '2666-0041', 1617, 15, '2024-06-01 08:53:45', '2024-06-01 08:53:45'),
(4, '2024-06-01', '2023-06-30', 'a_308356851', 's_296', '0999045544041', 0, 0, 1, 1, 'Коледино', 0, 1, 683120001, 'subject_4226', 'category_03405', 'brand_1943385', '2666-0041', 4574, 15, '2024-06-01 08:53:45', '2024-06-01 08:53:45'),
(5, '2024-06-01', '2023-06-30', 'a_267961357', 's_296', '4197275925749', 0, 0, 1, 1, 'Коледино', 0, 1, 88016599, 'subject_3082', 'category_03405', 'brand_1943385', '2666-0041', 2936, 15, '2024-06-01 08:53:45', '2024-06-01 08:53:45'),
(6, '2024-06-01', '2023-06-30', 'a_558402327', 's_296', '9552234696158', 0, 0, 1, 1, 'Коледино', 0, 1, 58529735, 'subject_3082', 'category_03405', 'brand_1943385', '2666-0041', 3117, 15, '2024-06-01 08:53:45', '2024-06-01 08:53:45'),
(7, '2024-06-01', '2023-06-30', 'a_644822804', 's_296', '2230547115862', 0, 0, 1, 1, 'Коледино', 1, 0, 47556332, 'subject_3082', 'category_03405', 'brand_1943385', '2666-0041', 1940, 15, '2024-06-01 08:53:45', '2024-06-01 08:53:45'),
(8, '2024-06-01', '2023-06-30', 'a_459232710', 's_296', '4434458621089', 0, 0, 1, 2, 'Казань', 2, 0, 699691999, 'subject_6037', 'category_03405', 'brand_4968105', '2666-0041', 1360, 15, '2024-06-01 08:53:45', '2024-06-01 08:53:45'),
(9, '2024-06-01', '2023-06-30', 'a_159781549', 's_296', '5340728291187', 0, 0, 1, 1, 'Коледино', 0, 1, 581760269, 'subject_4226', 'category_03405', 'brand_1943385', '2666-0041', 7182, 15, '2024-06-01 08:53:45', '2024-06-01 08:53:45'),
(10, '2024-06-01', '2023-06-30', 'a_886224581', 's_296', '7672291788320', 0, 0, 1, 1, 'Санкт-Петербург', 0, 1, 517502602, 'subject_4734', 'category_03405', 'brand_4968105', '2666-0041', 776, 15, '2024-06-01 08:53:45', '2024-06-01 08:53:45'),
(11, '2024-06-01', '2023-06-30', 'a_518509315', 's_296', '2684387577020', 0, 0, 1, 1, 'Электросталь', 0, 1, 708517780, 'subject_4734', 'category_03405', 'brand_3093082', '2666-0041', 944, 15, '2024-06-01 08:53:45', '2024-06-01 08:53:45'),
(12, '2024-06-01', '2023-06-30', 'a_888515942', 's_296', '3429035414952', 0, 0, 1, 5, 'Коледино', 0, 5, 621501405, 'subject_4734', 'category_03405', 'brand_3093082', '2666-0041', 944, 15, '2024-06-01 08:53:45', '2024-06-01 08:53:45'),
(13, '2024-06-01', '2023-06-30', 'a_888515942', 's_296', '3429035414952', 0, 0, 1, 1, 'Электросталь', 0, 1, 621501405, 'subject_4734', 'category_03405', 'brand_3093082', '2666-0041', 944, 15, '2024-06-01 08:53:45', '2024-06-01 08:53:45'),
(14, '2024-06-01', '2023-06-30', 'a_999022043', 's_296', '4622870664886', 0, 0, 1, 1, 'Санкт-Петербург', 0, 1, 719828674, 'subject_4734', 'category_03405', 'brand_3093082', '2666-0041', 889, 15, '2024-06-01 08:53:45', '2024-06-01 08:53:45'),
(15, '2024-06-01', '2023-06-30', 'a_117340854', 's_296', '1961536653174', 0, 0, 1, 1, 'Коледино', 1, 0, 32091293, 'subject_4734', 'category_03405', 'brand_3093082', '2666-0041', 1348, 15, '2024-06-01 08:53:45', '2024-06-01 08:53:45'),
(16, '2024-06-01', '2023-06-30', 'a_028524070', 's_296', '5706977187006', 0, 0, 1, 1, 'Коледино', 0, 1, 823416884, 'subject_3356', 'category_03405', 'brand_1943385', '2666-0041', 18677, 15, '2024-06-01 08:53:45', '2024-06-01 08:53:45'),
(17, '2024-06-01', '2023-06-30', 'a_380675815', 's_296', '8796967844501', 0, 0, 1, 1, 'Казань', 0, 1, 618021413, 'subject_3356', 'category_03405', 'brand_1943385', '2666-0041', 25511, 15, '2024-06-01 08:53:45', '2024-06-01 08:53:45'),
(18, '2024-06-01', '2023-06-30', 'a_091067220', 's_296', '3452139977452', 0, 0, 1, 3, 'Коледино', 1, 2, 171696596, 'subject_3356', 'category_03405', 'brand_1943385', '2666-0041', 11828, 15, '2024-06-01 08:53:45', '2024-06-01 08:53:45'),
(19, '2024-06-01', '2023-06-30', 'a_899960023', 's_296', '8108000895430', 0, 0, 1, 1, 'Екатеринбург', 1, 0, 96883663, 'subject_3356', 'category_03405', 'brand_1943385', '2666-0041', 12775, 15, '2024-06-01 08:53:45', '2024-06-01 08:53:45'),
(20, '2024-06-01', '2023-06-30', 'a_899960023', 's_296', '8108000895430', 0, 0, 1, 1, 'Подольск', 0, 1, 96883663, 'subject_3356', 'category_03405', 'brand_1943385', '2666-0041', 12775, 15, '2024-06-01 08:53:45', '2024-06-01 08:53:45'),
(21, '2024-06-01', '2023-06-30', 'a_887430415', 's_296', '1672162549357', 0, 0, 1, 1, 'Коледино', 0, 1, 274670479, 'subject_7025', 'category_03405', 'brand_6791887', '2666-0041', 27876, 15, '2024-06-01 08:53:45', '2024-06-01 08:53:45'),
(22, '2024-06-01', '2023-06-30', 'a_552356451', 's_296', '2109747771477', 0, 0, 1, 1, 'Казань', 0, 1, 775153723, 'subject_4496', 'category_03405', 'brand_3093082', '2666-0041', 1146, 15, '2024-06-01 08:53:45', '2024-06-01 08:53:45'),
(23, '2024-06-01', '2023-06-30', 'a_077382075', 's_296', '0111917189009', 0, 0, 1, 2, 'Электросталь', 0, 2, 917570502, 'subject_4496', 'category_03405', 'brand_3093082', '2666-0041', 842, 15, '2024-06-01 08:53:46', '2024-06-01 08:53:46'),
(24, '2024-06-01', '2023-06-30', 'a_877616351', 's_296', '7889435113898', 0, 0, 1, 1, 'Электросталь', 0, 1, 540013041, 'subject_4496', 'category_03405', 'brand_3093082', '2666-0041', 1209, 15, '2024-06-01 08:53:46', '2024-06-01 08:53:46'),
(25, '2024-06-01', '2023-06-30', 'a_690418341', 's_296', '4735581658301', 0, 0, 1, 1, 'Электросталь', 0, 1, 454769597, 'subject_4496', 'category_03405', 'brand_3093082', '2666-0041', 1208, 15, '2024-06-01 08:53:46', '2024-06-01 08:53:46'),
(26, '2024-06-01', '2023-06-30', 'a_649219925', 's_296', '1347936668989', 0, 0, 1, 1, 'Электросталь', 0, 1, 181522458, 'subject_4496', 'category_03405', 'brand_3093082', '2666-0041', 1342, 15, '2024-06-01 08:53:46', '2024-06-01 08:53:46'),
(27, '2024-06-01', '2023-06-30', 'a_755224360', 's_296', '1765924543986', 0, 0, 1, 1, 'Краснодар', 0, 1, 714661461, 'subject_4496', 'category_03405', 'brand_3093082', '2666-0041', 1437, 15, '2024-06-01 08:53:46', '2024-06-01 08:53:46'),
(28, '2024-06-01', '2023-06-30', 'a_070262402', 's_296', '5304241194004', 0, 0, 1, 1, 'Казань', 0, 1, 243739315, 'subject_1153', 'category_03405', 'brand_6791887', '2666-0041', 5170, 15, '2024-06-01 08:53:46', '2024-06-01 08:53:46'),
(29, '2024-06-01', '2023-06-30', 'a_456621521', 's_296', '8514721178479', 0, 0, 1, 1, 'Коледино', 0, 1, 238532547, 'subject_1153', 'category_03405', 'brand_6791887', '2666-0041', 8619, 15, '2024-06-01 08:53:46', '2024-06-01 08:53:46'),
(30, '2024-06-01', '2023-06-30', 'a_642220565', 's_296', '6209164429437', 0, 0, 1, 1, 'Коледино', 0, 1, 666852773, 'subject_7025', 'category_03405', 'brand_1943385', '2666-0041', 16499, 15, '2024-06-01 08:53:46', '2024-06-01 08:53:46'),
(31, '2024-06-01', '2023-06-30', 'a_790725170', 's_296', '1368512133786', 0, 0, 1, 1, 'Коледино', 0, 1, 19842350, 'subject_8623', 'category_03405', 'brand_6791887', '2666-0041', 994, 15, '2024-06-01 08:53:46', '2024-06-01 08:53:46'),
(32, '2024-06-01', '2023-06-30', 'a_790725170', 's_296', '1368512133786', 0, 0, 1, 1, 'Подольск', 0, 1, 19842350, 'subject_8623', 'category_03405', 'brand_6791887', '2666-0041', 994, 15, '2024-06-01 08:53:46', '2024-06-01 08:53:46'),
(33, '2024-06-01', '2023-06-30', 'a_635104200', 's_296', '8426960652633', 0, 0, 1, 1, 'Новосибирск', 0, 1, 547583118, 'subject_4734', 'category_03405', 'brand_4968105', '2666-0041', 506, 15, '2024-06-01 08:53:46', '2024-06-01 08:53:46'),
(34, '2024-06-01', '2023-06-30', 'a_690259960', 's_296', '2195893386521', 0, 0, 1, 1, 'Санкт-Петербург', 0, 1, 698501855, 'subject_1153', 'category_03405', 'brand_6791887', '2666-0041', 999, 15, '2024-06-01 08:53:46', '2024-06-01 08:53:46'),
(35, '2024-06-01', '2023-06-30', 'a_456234806', 's_296', '5221564364181', 0, 0, 1, 1, 'Коледино', 0, 1, 761709549, 'subject_3405', 'category_03405', 'brand_5192677', '2666-0041', 4399, 11, '2024-06-01 08:53:46', '2024-06-01 08:53:46'),
(36, '2024-06-01', '2023-06-30', 'a_902647480', 's_296', '1042529360350', 0, 0, 1, 1, 'Екатеринбург', 0, 1, 104517871, 'subject_8623', 'category_03405', 'brand_3093082', '2666-0041', 161, 10, '2024-06-01 08:53:46', '2024-06-01 08:53:46'),
(37, '2024-06-01', '2023-06-30', 'a_023051623', 's_296', '5375913104570', 0, 0, 1, 1, 'Коледино', 0, 1, 61998914, 'subject_3082', 'category_03405', 'brand_6791887', '2666-0041', 2034, 15, '2024-06-01 08:53:46', '2024-06-01 08:53:46'),
(38, '2024-06-01', '2023-06-30', 'a_203652574', 's_296', '6791091601555', 0, 0, 1, 1, 'Казань', 0, 1, 640516500, 'subject_1153', 'category_03405', 'brand_6791887', '2666-0041', 1085, 15, '2024-06-01 08:53:46', '2024-06-01 08:53:46'),
(39, '2024-06-01', '2023-06-30', 'a_612705090', 's_296', '0854609990515', 0, 0, 1, 1, 'Коледино', 0, 1, 678603939, 'subject_3356', 'category_03405', 'brand_1943385', '2666-0041', 11828, 15, '2024-06-01 08:53:46', '2024-06-01 08:53:46'),
(40, '2024-06-01', '2023-06-30', 'a_422601036', 's_296', '2905159001812', 0, 0, 1, 2, 'Новосибирск', 0, 2, 521082366, 'subject_4496', 'category_03405', 'brand_3093082', '2666-0041', 2111, 15, '2024-06-01 08:53:46', '2024-06-01 08:53:46'),
(41, '2024-06-01', '2023-06-30', 'a_073060774', 's_296', '7964467662482', 0, 0, 1, 1, 'Коледино', 0, 1, 563828274, 'subject_9542', 'category_03405', 'brand_6791887', '2666-0041', 673, 15, '2024-06-01 08:53:46', '2024-06-01 08:53:46'),
(42, '2024-06-01', '2023-06-30', 'a_819933325', 's_296', '4198717723236', 0, 0, 1, 1, 'Краснодар', 0, 1, 855245024, 'subject_6037', 'category_03405', 'brand_4968105', '2666-0041', 840, 15, '2024-06-01 08:53:46', '2024-06-01 08:53:46'),
(43, '2024-06-01', '2023-06-30', 'a_028346551', 's_296', '4939487867457', 0, 0, 1, 1, 'Екатеринбург', 0, 1, 636297232, 'subject_6037', 'category_03405', 'brand_4968105', '2666-0041', 1052, 15, '2024-06-01 08:53:47', '2024-06-01 08:53:47'),
(44, '2024-06-01', '2023-06-30', 'a_410015241', 's_296', '7685494759038', 0, 0, 1, 1, 'Электросталь', 0, 1, 21204684, 'subject_4496', 'category_03405', 'brand_3093082', '2666-0041', 1209, 15, '2024-06-01 08:53:47', '2024-06-01 08:53:47'),
(45, '2024-06-01', '2023-06-30', 'a_266438652', 's_296', '3571627013686', 0, 0, 1, 1, 'Коледино', 0, 1, 962185147, 'subject_4734', 'category_03405', 'brand_5802982', '2666-0041', 2364, 40, '2024-06-01 08:53:47', '2024-06-01 08:53:47'),
(46, '2024-06-01', '2023-06-30', 'a_620749685', 's_296', '7131284965301', 0, 0, 1, 5, 'Электросталь', 0, 5, 507456755, 'subject_8623', 'category_03405', 'brand_3093082', '2666-0041', 707, 10, '2024-06-01 08:53:47', '2024-06-01 08:53:47'),
(47, '2024-06-01', '2023-06-30', 'a_736108798', 's_296', '6866522078188', 0, 0, 1, 1, 'Екатеринбург', 1, 0, 863166907, 'subject_6037', 'category_03405', 'brand_4968105', '2666-0041', 189, 15, '2024-06-01 08:53:47', '2024-06-01 08:53:47'),
(48, '2024-06-01', '2023-06-30', 'a_518582177', 's_296', '3527908865358', 0, 0, 1, 1, 'Хабаровск', 0, 1, 652236187, 'subject_4061', 'category_03405', 'brand_6791887', '2666-0041', 1196, 15, '2024-06-01 08:53:47', '2024-06-01 08:53:47'),
(49, '2024-06-01', '2023-06-30', 'a_390670376', 's_296', '6883576392025', 0, 0, 1, 1, 'Электросталь', 0, 1, 995632344, 'subject_4734', 'category_03405', 'brand_3093082', '2666-0041', 944, 15, '2024-06-01 08:53:47', '2024-06-01 08:53:47'),
(50, '2024-06-01', '2023-06-30', 'a_436735468', 's_296', '6464679105105', 0, 0, 1, 7, 'Коледино', 0, 7, 132323271, 'subject_4734', 'category_03405', 'brand_3093082', '2666-0041', 726, 15, '2024-06-01 08:53:47', '2024-06-01 08:53:47'),
(51, '2024-06-01', '2023-06-30', 'a_375991078', 's_296', '6484673472957', 0, 0, 1, 1, 'Подольск', 0, 1, 203740566, 'subject_6037', 'category_03405', 'brand_4968105', '2666-0041', 555, 15, '2024-06-01 08:53:47', '2024-06-01 08:53:47'),
(52, '2024-06-01', '2023-06-30', 'a_517360862', 's_296', '6101839100809', 0, 0, 1, 3, 'Коледино', 0, 3, 102930411, 'subject_8623', 'category_03405', 'brand_3093082', '2666-0041', 1415, 15, '2024-06-01 08:53:47', '2024-06-01 08:53:47'),
(53, '2024-06-01', '2023-06-30', 'a_020415872', 's_296', '4306743014810', 0, 0, 1, 3, 'Казань', 0, 3, 393055917, 'subject_6037', 'category_03405', 'brand_4968105', '2666-0041', 2167, 15, '2024-06-01 08:53:47', '2024-06-01 08:53:47'),
(54, '2024-06-01', '2023-06-30', 'a_227079027', 's_296', '6977842479774', 0, 0, 1, 1, 'Коледино', 0, 1, 88144693, 'subject_3082', 'category_03405', 'brand_6791887', '2666-0041', 1730, 15, '2024-06-01 08:53:47', '2024-06-01 08:53:47'),
(55, '2024-06-01', '2023-06-30', 'a_090696320', 's_296', '7098295107066', 0, 0, 1, 2, 'Казань', 0, 2, 320028146, 'subject_6037', 'category_03405', 'brand_4968105', '2666-0041', 1055, 15, '2024-06-01 08:53:47', '2024-06-01 08:53:47'),
(56, '2024-06-01', '2023-06-30', 'a_316773870', 's_296', '7828540384772', 0, 0, 1, 2, 'Краснодар', 0, 2, 112012381, 'subject_6037', 'category_03405', 'brand_4968105', '2666-0041', 934, 15, '2024-06-01 08:53:47', '2024-06-01 08:53:47'),
(57, '2024-06-01', '2023-06-30', 'a_548717505', 's_296', '0379779484726', 0, 0, 1, 2, 'Подольск', 0, 2, 265884100, 'subject_6037', 'category_03405', 'brand_4968105', '2666-0041', 831, 15, '2024-06-01 08:53:47', '2024-06-01 08:53:47'),
(58, '2024-06-01', '2023-06-30', 'a_706694810', 's_296', '5646218771049', 0, 0, 1, 1, 'Екатеринбург', 0, 1, 888741605, 'subject_6037', 'category_03405', 'brand_4968105', '2666-0041', 699, 15, '2024-06-01 08:53:47', '2024-06-01 08:53:47'),
(59, '2024-06-01', '2023-06-30', 'a_633154365', 's_296', '2619396995718', 0, 0, 1, 1, 'Коледино', 0, 1, 622639693, 'subject_0229', 'category_03405', 'brand_6791887', '2666-0041', 965, 15, '2024-06-01 08:53:47', '2024-06-01 08:53:47'),
(60, '2024-06-01', '2023-06-30', 'a_736108798', 's_296', '6866522078188', 0, 0, 1, 1, 'Коледино', 0, 1, 863166907, 'subject_6037', 'category_03405', 'brand_4968105', '2666-0041', 189, 15, '2024-06-01 08:53:47', '2024-06-01 08:53:47'),
(61, '2024-06-01', '2023-07-02', 'a_503233846', 's_296', '2246062929429', 0, 0, 1, 1, 'Электросталь', 0, 1, 387899667, 'subject_9725', 'category_03405', 'brand_0991119', '2666-0041', 879, 10, '2024-06-01 08:53:47', '2024-06-01 08:53:47'),
(62, '2024-06-01', '2023-08-06', 'a_255883746', 's_296', '5678464213346', 0, 0, 1, 1, 'Казань', 0, 1, 216184008, 'subject_6037', 'category_03405', 'brand_4968105', '2666-0041', 1137, 15, '2024-06-01 08:53:48', '2024-06-01 08:53:48'),
(63, '2024-06-01', '2023-08-12', 'a_070262402', 's_296', '5304241194004', 0, 0, 1, 1, 'Краснодар', 1, 0, 243739315, 'subject_1153', 'category_03405', 'brand_6791887', '2666-0041', 6303, 15, '2024-06-01 08:53:48', '2024-06-01 08:53:48'),
(64, '2024-06-01', '2023-08-14', 'a_203652574', 's_296', '6791091601555', 0, 0, 1, 1, 'Пушкино', 1, 0, 640516500, 'subject_1153', 'category_03405', 'brand_6791887', '2666-0041', 1244, 15, '2024-06-01 08:53:48', '2024-06-01 08:53:48'),
(65, '2024-06-01', '2023-08-24', 'a_805302011', 's_296', '2888592598545', 0, 0, 1, 2, 'Казань', 0, 2, 186628227, 'subject_6037', 'category_03405', 'brand_4968105', '2666-0041', 1700, 15, '2024-06-01 08:53:48', '2024-06-01 08:53:48'),
(66, '2024-06-01', '2023-09-03', 'a_805302011', 's_296', '2888592598545', 0, 0, 1, 3, 'Краснодар', 0, 3, 186628227, 'subject_6037', 'category_03405', 'brand_4968105', '2666-0041', 1700, 15, '2024-06-01 08:53:48', '2024-06-01 08:53:48'),
(67, '2024-06-01', '2023-09-16', 'a_050519509', 's_296', '4344311848198', 0, 0, 1, 1, 'Коледино', 0, 1, 339151691, 'subject_7025', 'category_03405', 'brand_1943385', '2666-0041', 2247, 0, '2024-06-01 08:53:48', '2024-06-01 08:53:48'),
(68, '2024-06-01', '2023-09-16', 'a_972555223', 's_296', '9365699923683', 0, 0, 1, 1, 'Коледино', 0, 1, 565379301, 'subject_7025', 'category_03405', 'brand_1943385', '2666-0041', 4906, 0, '2024-06-01 08:53:48', '2024-06-01 08:53:48'),
(69, '2024-06-01', '2023-09-16', 'a_899960023', 's_296', '8108000895430', 0, 0, 1, 1, 'Коледино', 0, 1, 96883663, 'subject_3356', 'category_03405', 'brand_1943385', '2666-0041', 13541, 15, '2024-06-01 08:53:48', '2024-06-01 08:53:48'),
(70, '2024-06-01', '2023-09-16', 'a_102925723', 's_296', '0656373922082', 0, 0, 1, 1, 'Подольск', 0, 1, 975772560, 'subject_7025', 'category_03405', 'brand_1943385', '2666-0041', 3180, 0, '2024-06-01 08:53:48', '2024-06-01 08:53:48'),
(71, '2024-06-01', '2023-09-16', 'a_820369194', 's_296', '8997079946347', 0, 0, 1, 2, 'Коледино', 0, 2, 188181819, 'subject_3171', 'category_03405', 'brand_1943385', '2666-0041', 1050, 15, '2024-06-01 08:53:48', '2024-06-01 08:53:48'),
(72, '2024-06-01', '2023-09-16', 'a_152867181', 's_296', '1451723650524', 0, 0, 1, 1, 'Коледино', 0, 1, 793859332, 'subject_6037', 'category_03405', 'brand_4968105', '2666-0041', 2152, 15, '2024-06-01 08:53:48', '2024-06-01 08:53:48'),
(73, '2024-06-01', '2023-09-16', 'a_536588541', 's_296', '6840124985602', 0, 0, 1, 1, 'Казань', 0, 1, 478443297, 'subject_4734', 'category_03405', 'brand_4968105', '2666-0041', 830, 15, '2024-06-01 08:53:48', '2024-06-01 08:53:48'),
(74, '2024-06-01', '2023-09-16', 'a_602678332', 's_296', '3274399440674', 0, 0, 1, 1, 'Электросталь', 0, 1, 504513705, 'subject_3356', 'category_03405', 'brand_1943385', '2666-0041', 20641, 15, '2024-06-01 08:53:48', '2024-06-01 08:53:48'),
(75, '2024-06-01', '2023-09-16', 'a_958297136', 's_296', '6864768881346', 0, 0, 1, 1, 'Электросталь', 0, 1, 903103968, 'subject_6037', 'category_03405', 'brand_4968105', '2666-0041', 663, 15, '2024-06-01 08:53:48', '2024-06-01 08:53:48'),
(76, '2024-06-01', '2023-09-16', 'a_602678332', 's_296', '3274399440674', 0, 0, 1, 2, 'Коледино', 0, 2, 504513705, 'subject_3356', 'category_03405', 'brand_1943385', '2666-0041', 20641, 15, '2024-06-01 08:53:48', '2024-06-01 08:53:48'),
(77, '2024-06-01', '2023-09-16', 'a_118339220', 's_296', '5794567011423', 0, 0, 1, 2, 'Коледино', 0, 2, 545538572, 'subject_4734', 'category_03405', 'brand_4968105', '2666-0041', 877, 15, '2024-06-01 08:53:48', '2024-06-01 08:53:48'),
(78, '2024-06-01', '2023-09-16', 'a_877616351', 's_296', '7889435113898', 0, 0, 1, 1, 'Коледино', 0, 1, 540013041, 'subject_4496', 'category_03405', 'brand_3093082', '2666-0041', 1281, 15, '2024-06-01 08:53:48', '2024-06-01 08:53:48'),
(79, '2024-06-01', '2023-09-16', 'a_608700610', 's_296', '6028860587381', 0, 0, 1, 1, 'Подольск', 0, 1, 52701158, 'subject_4496', 'category_03405', 'brand_3093082', '2666-0041', 2372, 15, '2024-06-01 08:53:48', '2024-06-01 08:53:48'),
(80, '2024-06-01', '2023-09-16', 'a_608700610', 's_296', '6028860587381', 0, 0, 1, 3, 'Электросталь', 0, 3, 52701158, 'subject_4496', 'category_03405', 'brand_3093082', '2666-0041', 2372, 15, '2024-06-01 08:53:48', '2024-06-01 08:53:48'),
(81, '2024-06-01', '2023-09-16', 'a_029633945', 's_296', '7664330772540', 0, 0, 1, 1, 'Казань', 0, 1, 766152468, 'subject_4496', 'category_03405', 'brand_3093082', '2666-0041', 844, 15, '2024-06-01 08:53:49', '2024-06-01 08:53:49'),
(82, '2024-06-01', '2023-09-16', 'a_182860671', 's_296', '6433659382699', 0, 0, 1, 1, 'Коледино', 0, 1, 291861241, 'subject_8623', 'category_03405', 'brand_3093082', '2666-0041', 730, 15, '2024-06-01 08:53:49', '2024-06-01 08:53:49'),
(83, '2024-06-01', '2023-09-16', 'a_972260088', 's_296', '2309248098599', 0, 0, 1, 1, 'Коледино', 0, 1, 273003998, 'subject_6881', 'category_03405', 'brand_3093082', '2666-0041', 4254, 15, '2024-06-01 08:53:49', '2024-06-01 08:53:49'),
(84, '2024-06-01', '2023-09-16', 'a_693557401', 's_296', '5551837974880', 0, 0, 1, 1, 'Коледино', 0, 1, 469949699, 'subject_3356', 'category_03405', 'brand_1943385', '2666-0041', 13042, 15, '2024-06-01 08:53:49', '2024-06-01 08:53:49'),
(85, '2024-06-01', '2023-09-16', 'a_507795231', 's_296', '5674314234229', 0, 0, 1, 1, 'Коледино', 0, 1, 777536446, 'subject_1153', 'category_03405', 'brand_6791887', '2666-0041', 1469, 15, '2024-06-01 08:53:49', '2024-06-01 08:53:49'),
(86, '2024-06-01', '2023-09-16', 'a_456234806', 's_296', '5221564364181', 1, 0, 1, 1, 'Электросталь', 0, 0, 761709549, 'subject_3405', 'category_03405', 'brand_5192677', '2666-0041', 4662, 11, '2024-06-01 08:53:49', '2024-06-01 08:53:49'),
(87, '2024-06-01', '2023-09-16', 'a_133168849', 's_296', '3137138675901', 0, 0, 1, 1, 'Коледино', 1, 0, 60542285, 'subject_1645', 'category_03405', 'brand_6791887', '2666-0041', 1169, 15, '2024-06-01 08:53:49', '2024-06-01 08:53:49'),
(88, '2024-06-01', '2023-09-16', 'a_448752121', 's_296', '3627386266887', 0, 0, 1, 1, 'Электросталь', 0, 1, 771358508, 'subject_8623', 'category_03405', 'brand_3093082', '2666-0041', 563, 10, '2024-06-01 08:53:49', '2024-06-01 08:53:49'),
(89, '2024-06-01', '2023-09-16', 'a_352869981', 's_296', '1086691746327', 0, 0, 1, 1, 'Краснодар', 0, 1, 4579132, 'subject_1153', 'category_03405', 'brand_6791887', '2666-0041', 525, 15, '2024-06-01 08:53:49', '2024-06-01 08:53:49'),
(90, '2024-06-01', '2023-09-16', 'a_485906778', 's_296', '2359944969946', 0, 0, 1, 1, 'Коледино', 0, 1, 508395020, 'subject_1153', 'category_03405', 'brand_6791887', '2666-0041', 2424, 15, '2024-06-01 08:53:49', '2024-06-01 08:53:49'),
(91, '2024-06-01', '2023-09-16', 'a_096976484', 's_296', '1534787611704', 0, 0, 1, 1, 'Коледино', 0, 1, 971305839, 'subject_1153', 'category_03405', 'brand_6791887', '2666-0041', 1348, 15, '2024-06-01 08:53:49', '2024-06-01 08:53:49'),
(92, '2024-06-01', '2023-09-19', 'a_516665978', 's_296', '4620295013271', 0, 0, 1, 1, 'Екатеринбург', 0, 1, 876074447, 'subject_7025', 'category_03405', 'brand_1943385', '2666-0041', 3841, 0, '2024-06-01 08:53:49', '2024-06-01 08:53:49'),
(93, '2024-06-01', '2023-09-20', 'a_340582254', 's_296', '7541163259591', 0, 0, 1, 1, 'Коледино', 0, 1, 222588949, 'subject_3082', 'category_03405', 'brand_6791887', '2666-0041', 2281, 15, '2024-06-01 08:53:49', '2024-06-01 08:53:49'),
(94, '2024-06-01', '2023-09-21', 'a_805302011', 's_296', '2888592598545', 0, 0, 1, 1, 'Электросталь', 0, 1, 186628227, 'subject_6037', 'category_03405', 'brand_4968105', '2666-0041', 1699, 15, '2024-06-01 08:53:49', '2024-06-01 08:53:49'),
(95, '2024-06-01', '2023-09-22', 'a_128610954', 's_296', '1033895033241', 0, 1, 0, 2, 'Коледино', 2, 0, 978358099, 'subject_6037', 'category_03405', 'brand_4968105', '7636-9876', 534, 15, '2024-06-01 08:53:49', '2024-06-01 08:53:49'),
(96, '2024-06-01', '2023-09-22', 'a_128610954', 's_296', '1033895033241', 0, 0, 1, 1, 'Коледино', 1, 0, 978358099, 'subject_6037', 'category_03405', 'brand_4968105', '2666-0041', 534, 15, '2024-06-01 08:53:49', '2024-06-01 08:53:49'),
(97, '2024-06-01', '2023-09-22', 'a_565710373', 's_296', '2278705978374', 0, 0, 1, 1, 'Электросталь', 1, 0, 210435572, 'subject_3082', 'category_03405', 'brand_1943385', '2666-0041', 2649, 0, '2024-06-01 08:53:49', '2024-06-01 08:53:49'),
(98, '2024-06-01', '2023-09-22', 'a_939941307', 's_296', '5242671265788', 0, 0, 1, 1, 'Электросталь', 0, 1, 899907980, 'subject_1645', 'category_03405', 'brand_4842913', '2666-0041', 265, 0, '2024-06-01 08:53:49', '2024-06-01 08:53:49'),
(99, '2024-06-01', '2023-09-22', 'a_655107990', 's_296', '8926101104538', 0, 0, 1, 3, 'Электросталь', 0, 3, 252365213, 'subject_8623', 'category_03405', 'brand_4968105', '2666-0041', 1037, 15, '2024-06-01 08:53:49', '2024-06-01 08:53:49'),
(100, '2024-06-01', '2023-09-23', 'a_616264214', 's_296', '7598020155706', 0, 1, 0, 2, 'Коледино', 1, 1, 805659520, 'subject_6881', 'category_03405', 'brand_3093082', '7636-9876', 2732, 15, '2024-06-01 08:53:50', '2024-06-01 08:53:50');

-- --------------------------------------------------------

--
-- Структура таблицы `users`
--

CREATE TABLE `users` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `name` varchar(191) COLLATE utf8mb4_unicode_ci NOT NULL,
  `email` varchar(191) COLLATE utf8mb4_unicode_ci NOT NULL,
  `email_verified_at` timestamp NULL DEFAULT NULL,
  `password` varchar(191) COLLATE utf8mb4_unicode_ci NOT NULL,
  `remember_token` varchar(100) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Индексы сохранённых таблиц
--

--
-- Индексы таблицы `failed_jobs`
--
ALTER TABLE `failed_jobs`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `failed_jobs_uuid_unique` (`uuid`);

--
-- Индексы таблицы `incomes`
--
ALTER TABLE `incomes`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `migrations`
--
ALTER TABLE `migrations`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `orders`
--
ALTER TABLE `orders`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `password_reset_tokens`
--
ALTER TABLE `password_reset_tokens`
  ADD PRIMARY KEY (`email`);

--
-- Индексы таблицы `personal_access_tokens`
--
ALTER TABLE `personal_access_tokens`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `personal_access_tokens_token_unique` (`token`),
  ADD KEY `personal_access_tokens_tokenable_type_tokenable_id_index` (`tokenable_type`,`tokenable_id`);

--
-- Индексы таблицы `sales`
--
ALTER TABLE `sales`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `stocks`
--
ALTER TABLE `stocks`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `users`
--
ALTER TABLE `users`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `users_email_unique` (`email`);

--
-- AUTO_INCREMENT для сохранённых таблиц
--

--
-- AUTO_INCREMENT для таблицы `failed_jobs`
--
ALTER TABLE `failed_jobs`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT для таблицы `incomes`
--
ALTER TABLE `incomes`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT для таблицы `migrations`
--
ALTER TABLE `migrations`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=11;

--
-- AUTO_INCREMENT для таблицы `orders`
--
ALTER TABLE `orders`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=101;

--
-- AUTO_INCREMENT для таблицы `personal_access_tokens`
--
ALTER TABLE `personal_access_tokens`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT для таблицы `sales`
--
ALTER TABLE `sales`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=101;

--
-- AUTO_INCREMENT для таблицы `stocks`
--
ALTER TABLE `stocks`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=101;

--
-- AUTO_INCREMENT для таблицы `users`
--
ALTER TABLE `users`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
